{
    "podcast_details": {
        "podcast_title": "Random Thoughts From The Road",
        "episode_title": "Great used cruisers to buy, and the ones to stay away from.",
        "episode_image": "https://ssl-static.libsyn.com/p/assets/8/6/e/3/86e30108beb21bde5f2e77a3093c12a1/random_thoughts-from-the-road-motorcycle-podcast-logo.png",
        "episode_transcript": " Shut up and sit down. Welcome to Random Thoughts from the Road on the Ozark Rides digital network. Conversations about motorcycles, any random thoughts that pop into our head, and of course, one of the best places to ride in America, the Ozark Mountains of Missouri and Arkansas. And now, here's your host from OzarkRides.com, Craig Allen and Randy Lewis. I love to get out and enjoy the great Ozarks on my ride. And you should too. Make sure your two-wheel or four-wheel ride is running its best by taking it to Heartland Honda in Springdale, Arkansas. They're pros at servicing and repairing your recreational on-road or off-road vehicle. And when it's time for something new or pre-owned, Heartland Honda can fix you up. Check them out online at heartlandhonda.com or give them a call at 479-751-7022. Heartland Honda. Work hard, play hard. You meet the nicest people at Heartland Honda. About 10 years ago, my best buddy talked me into buying a motorcycle so we could go touring around the Ozarks Mountains. The rides were amazing. One weekend, I couldn't go, but he went anyway. Tim was topping a hill on a big curve and was hit head on by a car passing an RV. Thankfully, he survived. And thankfully, he had Schmidt Law Firm on his side. I do too. motorcycle accidents happen. Schmidt Law Firm will prove negligence and help you get full recovery. Find them online at KansasCityLawyers.com. Put Schmidt Law Firm on your side of the table because motorcycle accidents do happen. Welcome back to another episode of random thoughts from the road with me as always is my esteemed colleague Randy bottoms up Lewis Bottoms up Lewis. Yeah, that's it. Yeah from bike works in Urbana, Missouri. Good morning young squire How are you doing my lady? What did you just say? I don't know what your pronouns are boys got a mouth like a cannon always shooting it off I'm just assuming. Don't assume, it makes an ass out of you. Not me, just you. Alright, sorry, sorry. Alright, alright, alright. So, have you had a good week? yeah it's been another week nonetheless nonetheless nothing terribly exciting to report no haven't had to kick anybody's ass out of your shop no no we're i try to refrain from doing that as much as possible all right not saying the potential is not there but it's just yeah exactly all right well we're going to talk about a couple of things uh one of the things i wanted to talk about real fast is remember last year or actually it was this year the beginning of the year Cycle Showcase in St. Louis. You didn't get to go. Sucks to be you. It does suck to be me. Well you get another chance because Cycle Showcase is coming to Lake of the Ozarks Bike Fest and that'll be next month the 14th through the 17th I believe. and that'll be at the resort at Lake of the Ozarks and that'll be a really cool thing to go see. Sponsored of course by Schmidt Law, our partners there and we're going to be set up with a booth at the Cycle Showcase Bike Show. If you've never had a chance to go to a bike show, this is the kind of bike show that you want to start out on. This is a different bike show than what your atypical bike show is. Oh, yeah. Which is so cool about it. This is a big kind of, I would call it a big production bike show. Yeah. And it's done up right and it's done up nice. It's not just a bunch of guys wheeling their bikes out in the parking lot. Right. And you know, this is a well done deal. Yeah. This is bikes that you will probably not see everywhere every day at every other bike show. no these are real professional bike builders yeah exactly so if you get a chance next month september 14th through the 17th leg of the Ozarks Bike Fest at the resort and stop by say hi and take a look at some of the best bikes that you'll find so now i want to talk about our featured ride of the week. We're bringing that back by popular demand. And last episode, we talked about Push Mountain in Arkansas. So consequently, I'm gonna talk about a ride in Missouri, the Camdenton to Devil's Elbow ride. It's a 66 mile ride. It is a terrific ride, completely back roads. You won't see any highways or freeways on this ride. Now, I'm gonna admit something, I haven't been over there in some time. The last time that I did go over there, the Devil's Elbow, they had a little bar and grill there, right there at the bridge, was shut down, permanently. The reason I bring that up is because I cannot speak to whether somebody has purchased that and reopened it or not, but either way, it is a great ride, and if it has been reopened, so much the better. That bridge that's there is super, super cool. Like that's the shit that I dig about it. That bridge, it is really, it's old and it's neat. It's like a trust style bridge too. Right. And in case you're curious, you can go to OzarkRides.com and go to Missouri Rides. There'll be the Camdinton to Devil's Elbow ride featured right there. Of course, it's also our featured ride on the website, but we've got a video there of the ride and said bridge. that Randy was talking about, and you can check it out there, kind of get a flavor for what's going on. What we do is you start out on State Route A, and there's a lot of twisties, a lot of long sweepers, and a lot of scenic farmland. This whole ride is just completely back roads. Yeah. They're actually pretty decent roads. Last time I was on it, the roads were decent. A lot of them, they have recently repaved, so they're smooth. You don't have big shoulders by no means, but it's good quality roads. It's amazing scenery. We're getting to that time of year. We're here in the next month or two. It's going to start cooling off a little bit. The weather is going to be great. The trees are going to be changing. You say that with some confidence. That the weather is going to be cooling off? Shit. The way it's been lately, I'm not for sure, but everything, it happens. It will eventually cool off. right i suppose so the roads are really good until you get down to almost the devil's elbow and you come onto a stretch of route 66 as is customary with a lot of route 66 nowadays has not been maintained it is paved only in the technical strictest sense there's some asphalt somewhere on it somewhere and there's a well there's a they've compensated by filling it with a lot of potholes you know for your riding pleasure so but that stretch is only about a mile long you can deal with it you can deal with it you can think of it as riding through a landmines swerving and weaving and going around but definitely worth the ride check it out at OzarkRides.com our featured ride okay That being said, I wanted to bring up a topic that maybe you might be interested in talking about. And that topic is five used cruisers to buy now. They have to be used. And maybe your idea of five that you should avoid. oh yes please now these are not uh keep in mind you a lot of people think of cruisers they think of cross-country riding we're not talking about touring bikes we're talking about basic cruisers okay so i got a whole another we'll do a whole thing on on uh touring bikes later on but i'm going to start it off and obviously i'm going to pick a bike that you should have that is a cruiser and that is the victory octane do you remember this bike it's a water-cooled bike yeah yeah that's a good solid bike not a huge following on that bike either no there isn't it's a great bike definitely not a huge following it had a short but yet tragic history uh obviously paleris going out of business Polaris didn't go out of business. Well, not Polaris, but Victory. They opted to shut the Victory line down. How is it that I'm advocating for your cause? I don't know. You have to keep factoring. I'm getting old. Sometimes the left side of the brain goes down a road while the right side is on the porch still rocking chair. So anyways, I wanted to touch base on that too real quick. somebody emailed me and talked about you know you're always talking about victory and you can't find parts for victory and they're out of business and true victory is that line is shut down You will absolutely not ever, I don't think ever, even though they're 10 years they have to produce. But I saw a deal the other day where Victory was Polaris. They have two warehouses full of parts for all models of Victory. Now, you're going to run into problems finding aftermarket parts. Things that, I guess, how would you say it, that are not necessary to keep the bike running. Yes. But any mechanical parts, any engine parts, you know, things like that, you will never going to have a problem finding parts for it. I don't think that you will either. the hard parts as far as that goes. And you want custom accessories? Yeah. And that's where you and I have had to, you've had to build it for me. Yes. So the way you got to think about that is, is custom aftermarket manufacturers, they're not going to manufacture stuff for bikes that are no longer being produced. That's right. There's a cap to that market. There's no aftermarket company that wants to produce stuff where there's a cap on it. So the only time that you're going to get into other things, as far as that goes, is there's going to be like the Vic shop, which doctors places like that, that built their company on doing stuff for victories, right? They're going to still manufacture stuff. They're going to still have stuff laying around. They're going to still do stuff with it because that's their business. Now, granted, they're probably not going to build a shit ton of aftermarket parts for those first generation victories out there. but you get to the 10 or 12s and up to the end of their time, they're still making a bunch of parts for those. That's not as big a deal. There's a little sidebar there, but those of you out there that are thinking about getting a used Victory but are shying away because you didn't think you could maintain it, absolutely not the case. You're always going to have plugs, you're always going to have oils and oil filters. Any engine parts, you're going to have Yeah, say like Lloyd's, Lloyd's that does all their big performance stuff. I would almost guarantee you that you're going to be able to get parts now. Granted, the further away we go from the date that they stopped producing, more than likely the parts are going to get a little bit more expensive as opposed to when they were being produced right now. Yeah. So there is probably a net higher retail on your parts, but it's not to say that you won't ever, ever come up to a time where you just cannot get it. Yeah. in the near future. Fast forward 50, 60 years from now, yeah. You're gonna have a problem. If you can find a victory 50, 60 years from now, which I'm sure you can, that's the kind of bike you want to fix up and put in your living room as a showpiece. They weren't that good. Yeah, I thought they were. you know how i am so back on topic here like the octane you can get one now for less than eight thousand dollars and as a run around town kind of a cruiser water cooled that's not a bad deal now my polar opposite to that that you want to avoid is a suzuki boulevard s40 first of all it's uglier than dog snot yes it's it's just hideous looking a little single cylinder i kind of like the thumpers but this is an ugly bike and it's only had 31 horsepower 652 ccs stupid horrible hated them I didn't want to say it, so thank you very much for throwing it out there. So throw a bike out there that you think you should be able to pick up on. It has to be used. Here's what I would buy used. It's going to be Harley Davidson. And here's what I would not buy. First, let's go with the pro. What would you buy? Harley Davidson Heritage Classic. That's what I would buy if I'm buying just a standard cruiser model that is going to let you go cross country, that's going to let you go around town, that's going to let you do everything. They come factory with a crash bar, windshield, and saddlebags. Now you carry stuff with you. You have a little bit of a windbreak with the windshield. You have the crash bar to put your feet up if that's what you like. Curb weight's not bad on them, power's pretty decent on them. If you bridge back to say the early 2000s to 2005 or 2006, yeah you're an 88 twin cam 5 speed, but you can pick those up fairly reasonable. Somewhere between 5 and 7500 bucks still. The newer you go, yeah the price goes up on them, but they're a great all around bike and it's probably one of the reasons why that was Harley's number one selling motorcycle for so many years. people trying to get into Harley that's what you looked at I mean they pimped those bikes out like crazy like this is the best thing you can have you can go long distance you can do short trips they're comfortable all in one bike yeah and I really do think that they are fairly comfortable they're small enough to meet that beginner level entry you know the entry level into motorcycling in my opinion decently low saddle height not heavy still heavy enough to get up and down the road and run highway speeds but yet also big enough to where you can go cross country comfortably on them. Granted the five speeds a little bit harder to go cross country just because they are rpms not to say that you can't you get into the newer ones and you get a six speed and your 103 motor and now obviously they're building with bigger motors so they've adapted that right there is like the universal you know one size fits all that's a terrific motorcycle you can get them at a decent retail price. So that's why I would go with, granted it's Harley, because I'd always go with Harley, but it is- I believe everybody knew what you were going to pick. Yeah, yeah. It's just one of those bikes that ladies, men, beginner riders, experienced riders, they all gravitate to that bike for a reason. They work well, they look good, they look classic, You can ID them from anywhere so you get that feeling that everybody knows you're on a Harley. Because let's be honest, a lot of guys like that. Now, this is the one that I've absolutely loved to say out loud. The one that I would stay away from. Here we go. The early 2000's Victory V92 Classic Tourer. I'm going to correct you right there. Stay the frick away from that one. I'll tell you why. You are partially right. I'm very much so 1999 through 2001 Those are the ones you want to stay away from because they had a transmission problem. Yes, 2002 above. It's a solid bike. So Here's the reason why I say stay away from it For one they were ugly as shit Your bike may not be ugly now, but when you first got that bike That was ugly as ugly can be. I'm not going to sit here and look you in the eye and say you're wrong. Weird trimmings, disgusting saddlebags. The V92 TC. Yeah, the weird tail light turn signals in the saddlebags like absolute garbage in my opinion. The height of the bike from stock. It's a tall bike. Oh it is. Yeah. You can't tell me that just everybody and anybody can hop on that bike and just start ripping. No, it was tall. It was cumbersome. The positioning wasn't that great. The bars sucked on it. It just was not that good of a bike. Aesthetically, it wasn't great. no it was fitment it wasn't great no it wasn't now what's good about that bike is the engine now is a small engine at what 92 cubes yeah 1500 yeah so not that far out of line for what everybody else was producing at that time but now once you get it compared to something else like they come out a couple years later with the 106 that 106 a 10 time better motor they came out with a 100 and then a 106 but but you're right the further down the line they went The better. And honestly, you say up to 2003, you know, those were the good ones. 2002 is when the transmission was fixed. Right. You flash forward a couple years after 03 and now it's got that bigger motor. There's a reason why they jumped. And a different transmission, six speed. Yeah, there's a reason why they jumped to that other setup is because the last setup freaking sucked. It wasn't that great. Even for being a 92 cube, it didn't produce that much power. It wasn't like you were getting there and ripping canyons and being able to pull corners and pull out of corners or pull hills amazingly well. Even the little twin cam 88 did better than that thing did. You're hurting my feelings. yeah truth hurts truth hurts truth hurts okay i'm happy with my bike and it goes just fine i've had it over 100 miles an hour and i'm a fat yeah over how much time exactly took me a week and a half to get there pretty much pretty much another reason why we talk about we just talked about the parts being produced and stuff like that those are the absolute hardest years to find parts for bar none like they're just difficult to find parts and especially those horrible body panels and bags and trimmings and shit like that good freaking luck which people don't know none of that is on my bike no it's not it's all been completely revamped but even your little even your chrome struck covers those clips plastic clips To hold those on those that's true there. You can't find them and I found I found them through victory And I said screw that I just bought a box of them exactly just for the future and I Mean I've got it over there in the drawer. There's a whole big giant bag of clips, right? So that's why I say Freaking unless somebody's worked it over unless somebody's done something with it And you can get an idea of what the parameters are on that bike. They're an okay bike to buy Mainly because they're gonna have a really low retail price. They truth a stock 99 to 0102 V 92 classic tour is still same, you know same genetic makeup and Yeah, they're low Yeah, so that's the only thing that drives you to want to buy that bike is the low price point on it Yeah, I guess I wouldn't disagree because of your points. It was an ugly bike. Yeah, it was. I mean, it was just stupid ugly. What the frick is going on? Now, victory has always kind of been futuristic. in my opinion their their lines are very edgy like their jackpot and their vegas and their eight ball and all that stuff like those have got completely different style lines oh yeah they're totally different those times and like this one had a head of those ugly bags and a big barn door windshield which i absolutely hate those yeah um like even think about victory the vision like ugly holy shit like that's so far out of the realm of anything close to what's being produced at the time. Oh, when they come up with that bike, there was a group of guys sitting around a table drinking high balls and smoking blunts. Yeah, yeah. That's how they come up with that. Thank you, Arleness. As amazing man as that guy was, like that bike, I'm just like, whoa. yeah I couldn't you know disagree with what you said as far as based on those parameters but mechanically my bike is solid it is and so all the victory 92s it is I can't say that you're wrong the styling was a lack to be desired okay how about the yamaha bolt r special oh yeah the yamaha bolt yeah Are you yay or nay on that? Yay. Okay, yeah, I was gonna say that. You can find those like a 2014 model for well under $4,000 and that is a great bike. I mean, rock solid, reliable, good looking in my opinion, you know, for just a basic cruiser. Yeah, it's perspective. They performed well and they ran well and they handled well. Now, that you took a stab at me, I feel obligated to take a stab back at you. A bike to avoid, used, cruiser, the Harley Davidson Street Rod. The Street Rod? You definitely want to avoid that. That's the 750, 550, they claim it had like 75 horsepower. I'm calling bullshit. Yeah, they were very lackluster. Very lackluster, about 525 pounds they come in at. I don't know, it's just, It's ugly. It's ugly. Anemic on power. It just didn't work. And every manufacturer has these, what were you thinking bikes? Yeah, I could tell you what they were thinking on it. What were they thinking? A different market. They were trying to hit that hipster inner city, urban kind of the almost like the way you would see like in India and Europe, those small CC bikes, things like that. But they tried it in fat boy world where we like Big Macs, meat, potatoes, stuff like that. Yeah, it just didn't fly. So number four. OK. What do you got on to me then? OK. let me bridge to a bike that i like that's not harley davidson so here's what i will go with for one that i do like it would be the honda say these all have the same engines but it's just kind of the platforms look a little bit different And it's the Honda VTX 1300, whether it be the cruiser bike, whether it be the fury, whether it be the interstate, any of those bikes, in my opinion, are fantastic power plan for all of them. Yeah, they run that VTX 1300 engine. great bulletproof engine like I've seen customers just absolutely beat the piss out of those things and all you got to do is change your oil every once in a while and they they continue to run they make decent power they're very very rideable the price points on them are ridiculously good I like the interstate because it has a little bit more of a raked out front end but then it still has saddlebags on the back so you kind of get a meld of a little bit longer bike with being able to carry stuff The VTX1300 is, like I said, they're just killer motorcycles. I've worked on a ton of them. I've only had one or two that's had, you know, substantial issues. And I say substantial is just because it took me a little while to figure out what their problem was. And even then it wasn't even a big issue. The Honda Fury, when those things first came out, I'm a, I'm pro Harley. You have to say that. Even I was like, holy shit, like that's a cool bike. I dig it. The Honda Fury is a kind of a raked out chopper looking bike. Right. That stuff was really popular. Like Orange County choppers was popular. Exactly. This is like a production chopper. You know, they carry like a 200 wide back tire. Um, Kind of an up-and-out frame with a longer rake on it. I thought they handled okay Probably not amazing, but handled okay power was good The electronics were really good on it The only thing I didn't like about it is the small fuel tank that was on it. It couldn't go anywhere No, but it's so great about that engine is we're talking about three different motorcycles that use the same power plant There's a reason for that the VTX 1300 in my opinion was way better than the 1800 that they produced Now, when we talk about a world of more is better, you would think, oh, the 1800s got to be that much better. 1800 hadn't been produced like the 1300. And there's a reason why that 1300 just fricking worked for whatever reason. Now, when that fury came out, net retail was like 13, 14 grand, something like that. Now a net retail on it's about 7,500 to $8,500 brand new. Interstate relatively the same price point the VTX you find those used you could pick up a badass little VTX 1300 for 3500 4500 bucks Low miles great running bike. Everything's good. So that's a cheap cheap cruiser model bike that you can pick up So what do you hate? Here's what I absolutely have an extreme disdain for And it starts in the mid 90s and it runs pretty well through the rest of their class. The Kawasaki Vulcan 1500 and the 1600. Thought you had one of those. No, I used to have a 900 custom. Oh, OK. But I have always absolutely hated those 15 and 1600s. Explain, please. So I thought they were shit for power. I thought that aesthetically, whatever they were kind of round and robust it gave you a lot the suspension a shaft drive bike so that's i guess okay but i just hated it because i never felt like they really worked i never felt like they made enough power i never felt like they made enough usable torque or power i just felt like they were just kind of you know they're trying to hit that harley look with like the heritage and stuff that classic harley look I thought that the bag selection and the fender selection was too off, like they were very round, they had a bunch of racks on them. And for whatever reason, I've had to work on those sons of bucks like crazy. So when I see it on the mechanical side, if I'm seeing a certain model routinely for some of the same issues, it kind of decredits it in my opinion. all right all right well i've got one here that i think you should buy and you're going to find it peculiar coming out of my mouth that's the harley davidson roadster the roadster really the roadster yeah they're kind of it's an upgrade from a sportster yeah a little different uh styling on it but i i like the way it looks it was a great model as far as mechanically it had that 1202 engine in it a little bit larger gas tank than the sportster so you can go a little bit further on it. A little bit. I had a little charisma to it. You know, I think it's a pretty good looking little bike. It kind of reminded me of a somewhat of a cafe style because it had the low cafe handlebars on it. Yeah. And you know, I just kind of like that bike. But the one that I would avoid on the other side of that is the BMW 1200C. oh yeah yeah the r 1200 yes especially in the early first of all is uglier than dirt it's even uglier than the victory vision yeah yeah and that's saying something that vision is god-awful yeah Sorry to the guys that have them. Just say yeah, and let's not roll back into that. Anyways, I don't know what these things cost. You know, I don't imagine they would be too expensive. No. You know, the styling sucked. The passenger seat on it, if you wanted a ride, it had a little pillion seat. So anyways, that just happens to be our opinions, which of course are carved in stone. Yeah, yeah. Soft stone. This is the 10 commandments here. Soft stone, yeah. So limestone. Yeah. Anyways, kind of curious if you have a different idea of five go-to bikes or five to avoid, drop us a line, let us know. We'll give you a shout out. So I guess that's going to wrap it up for this episode. I want to remind people. We could go on for days about this topic. I know we could, but if you want to go on a little bit, you know, throw one more in there as a bonus. One more as a bonus? As a bonus. Well, naturally, where are we going? So here's a bike that is clearly classified as a touring motorcycle. But you cannot mention the Victory V92 TC twice. I will not. Believe me, you I will not. So I've got two bikes that I would say are a yay. So I'm going to be positive here. Two bikes that I would say are a yay for touring on or cruising on. Okay. Now this first one is classified as a touring bike, but there's a reason why I say it could be very well versed as a cruiser bike. That is the road King, the Harley road King. Now with the Road King, you could have got it with a couple of different bag options, one being hard saddlebags and one being a hard saddlebag that is leather wrapped. The reason why I say the Road King is a good cruiser bike is it doesn't have a fairing. It doesn't have a big front end on it. So it's a little bit lighter, a little bit nimbler, a little bit more user friendly to the guy that's just getting into bikes. Yes, it has a little bit higher curb weight than some of like the Harley Heritage or something. The reason why I say it's a great cruiser model bike is because it's very easy to hop on and ride. If you're not very well versed in riding, with the front end being stripped down, it makes it lighter on the front. It links it lighter on the steering. It makes it easier to see the front wheel. Plus you get an added bonus of having the saddlebags on the back. And with the square frame backbone, and a little bit heavier and a little bit longer, you can still cruise this thing very, very easily, but then dual purpose it for a long distance touring bike. So that's why I say it's kind of falls out of the touring catalog because it's very, very easy to hop on and run to the other end of town. It's pretty nimble. You can cruise around, you can whip in and out. I just feel like that's a very, very good platform to do both on. Okay. another one and nobody gives this bike credit. This is a positive. This is a positive man. And I, there's actually two bikes that kind of fall side by side that I absolutely love for cruising on. So one is the Suzuki M 109. I'm normally not a Suzuki fan, like absolute disdain for the brand as a, as a whole, except for two bikes. And that's the Jixxer line is a sport bike crotch rocket. and this M109. The reason why I say the M109 is because that thing makes so much freaking power. And it's got a large fuel cell on it. It's all about the giddy-up for you, isn't it? It really is, in most regards, yes. Aesthetically, eh, they're okay. If they're done up well, they're, they're okay, but they just make so much power, which makes cruising fun. Cause you talk about stoplight to stoplight or rip around town or short, you know, cornering type roads. They fricking do well. They make a shit ton of power. And when I mean a shit ton, like they make a lot of power, especially for the platform that they're on. The other one is handling wise this bike isn't that great. Stylistically it's cool. Cruising wise it makes good power. It's the Yamaha Striker and the Yamaha Raider. Both of those are kind of that chopper-esque feel. Smaller fuel tank so cruising is a little bit okay on that because you're not looking to stretch out. They look cool. They make good good-ass power. They got a little bit fatter back tire and they're both of those have somewhat of a relatively low used retail price. All right, I'll throw in one more bonus yeas. Okay. And that is the Victory Cross Country. Okay. You can still get those. It's a tour. It's a tour, but you can still get those for around seven, $8,000. Still, obviously, you can get parts for it, but of all the Victories, you can still have a large line of aftermarket parts. Yeah. yeah you know that cross country and the magnum are freaking great as far as that goes you want to strip down to a true cruiser go with the crossroads doesn't have the fairing that's right it's the same bike without the fairing exactly there you go so that's our picks if you disagree or agreed let us know drop us a line we'll give you a shout out Also want to remind you once again about the Cycle Showcase September 14th through the 17th at the resort at Lake of the Ozarks during Bike Fest. Stop by and see us. We'll be there with Schmidt Law and you'll see a lot of great bikes down there. Are you going to attend? Yeah, I'm going to really try my ass off. If not, I might take a bike over and put it with Schmidt Law's booth unless it gets accepted to be in the Showcase. You talking about the 70s, Chopper? Yeah, I might take it over there and let it set out. And then while I'm doing football stuff, maybe hit Saturday night and Sunday. Be down there. All right. Well, until then, be sure to stop by OzarkRides.com. Check out our featured ride. And if you'd like to help support the podcast and the website, can always go to patreon.com forward slash Ozark rides we sure would appreciate you becoming a member of the club and until the next time always ride safe and keep it on two wheels"
    },
    "podcast_summary": "In this podcast episode, the hosts discuss various motorcycle rides and bikes. They recommend the Victory Octane as a good cruiser bike to buy, but suggest avoiding the Suzuki Boulevard S40. They also mention the Harley Davidson Heritage Classic as a great all-around bike, but caution against the early 2000s Victory V92 Classic Tourer. The hosts also mention the Honda VTX 1300 as a reliable and affordable cruiser option, and recommend avoiding the Kawasaki Vulcan 1500 and 1600. As a bonus, they suggest considering the Road King as a versatile cruiser and touring bike, and the Suzuki M109, Yamaha Striker, and Victory Cross Country as other good options. They also mention the upcoming Cycle Showcase event at the Lake of the Ozarks Bike Fest.",
    "podcast_guest": {
        "name": "Craig Allen",
        "job": "Host of Random Thoughts from the Road",
        "summary": "",
        "URL": "https://ozarkrides.com/podcast.htm"
    },
    "podcast_highlights": "- Highlight 1 of the podcast: \"The Victory Octane is a fantastic water-cooled cruiser with a great price point.\"\n- Highlight 2 of the podcast: \"The Honda VTX 1300 is a solid and reliable cruiser with a low retail price.\"\n- Highlight 3 of the podcast: \"The Harley Davidson Road King is a versatile cruiser that can also handle touring.\"\n- Highlight 4 of the podcast: \"The Suzuki M109 and Yamaha Striker/Raider offer powerful cruising experiences.\"\n- Highlight 5 of the podcast: \"The Victory Cross Country and Crossroads are great options for cruisers with aftermarket parts availability.\""
}