{
    "podcast_details": {
        "podcast_title": "WizzWare :: Motorcycle Tips, Trips & Gear",
        "episode_title": "GoPro MotoVlog Setup for Idaho BDR - GoPro Motorcycle Chin Mount Setup for MotoVlogging",
        "episode_image": "https://storage.buzzsprout.com/variants/b2vz3l6xemfvvd89potvx0sr8uqk/f6fd9b4ca4e468e7e11c8350463c894b252ee834d352e0a8d889b97ac83aedef?.jpg",
        "episode_transcript": " Hello everybody and welcome to another Wizwear podcast where we are going to discuss how we set up our GoPro Hero 10 Black for the Idaho BDR. We know riders are getting ready for summer adventures so we wanted to do a session on how we set up our GoPro. We are hoping that this will save you some research time and ordering delays so you are out on your trip with a V-Log system you can count on. We're going to start out our equipment list and then get into why it was selected and some of the issues that you may or may not know about. First off on the list of course is the GoPro Hero 10 Black with GoPro subscription. Now I highly suggest you look at the GoPro website. They seem to have the best prices out there and I checked around quite a bit and that GoPro subscription is really nice because it's a no questions asked policy that if you break or do something to the GoPro it's just your GoPro is just automatically replaced which is pretty nice. Next is the GoPro Media Mod, which is something you're absolutely going to need. Next on the list is a Bell Helmet MX9 Adventure. Now, if you already have a helmet, that's great. You don't necessarily have to get a new one. This was just a completely new setup. Then you'll want a chinmounts.com helmet chin mount for, of course, the helmet of your choice, which in this case was a Bell Helmet MX9 Adventure. Next, The Drift Ghost 3.5mm external microphone. GoPro helmet front mount which actually fits into the chin mount. Portable charger power banks with USB out and micro USB in. Scan disc 256GB SD cards specified by GoPro because all scan disc cards are either faster or slower. So there's exact specifications that you need to get for GoPro and have one for each day of your trip. Battery Tender, Quick Disconnect, USB Adapter, but that's going to vary motorcycle to motorcycle. Some various USB cords for charging batteries and USB-C cord for running the GoPro Hero 10. So why did I choose the GoPro Hero 10 Black? There are so many different action cameras on the market, including prior versions of the GoPro. After a ton of research and hours of YouTube videos, I determined that every single action camera has one issue or another. So I finally bit the bullet and just got the newest GoPro and hoped for the best. So how did the GoPro Hero 10 Black perform on the Idaho BDR? After all the worrying and what-ifs, I would like to say that for V-Logging on a motorcycle chin mount with a separate power source, the GoPro Hero 10 Black performed very well. I was able to record all day onto a 256GB SD card without any random shutdowns or issues. I was simply able to turn the camera on and forget about it. The GoPro Hero 10 Black's performance, however, will depend on your use, mounting, and power source. Since I have had a prior GoPro, I knew I would need an external power source to V-Log for an extended amount of time, since the internal battery just does not last that long. This was a solution in disguise, because what you will find with just a little research is that the GoPro Hero 10 will overheat and turn off fairly quickly. It is not the fast processor like some suggest, but the heat from the battery discharging. So with the GoPro Hero 10's battery in place and attached to an external power source, the overheating problem does not exist and you can record for as long as you want. If you unplug the external battery source, however, your GoPro Hero 10 Black will heat up and eventually shut down. One side note I would like to mention about the GoPro Hero 10 Black. is that it uses a different video format. So if you have a slightly older computer, you may not be able to play your videos by plugging a memory card into your computer. There are however converter programs available. Next on the list is the GoPro Media Mod. which is required for a motorcycle V-Log chin mount. If you're familiar with the old GoPros, they had a complete enclosure to keep the camera dry. The problem was you could not charge or use an external microphone while the camera was in the enclosure. Now the GoPro is basically waterproof, but needs the media mod for an external power supply and microphone. The mod also enhances the waterproofing by providing a buffer between the USB-C and microphone RCA plugs and the camera. The actual GoPro Hero 10 does not have an external microphone input, so the Media Mod is absolutely necessary. Continuing down the list of items you will need, we have the chin mount for your motorcycle helmet. With the evolution of 3D printing, motorcycle helmet chin mounts are much easier to get. You can check out chinmounts.com where they make helmet specific mounts that fit exact and take into account your venting as much as possible. In my case, the helmet I was looking at purchasing did not have a chin mount available, so I got a Bell MX-9 Adventure instead. If you already have a helmet and a chin mount is not available, you can request to be notified when one is developed. They're making new models all the time. For installation, follow the instructions and use a safety tether just in case. So now we have the GoPro Hero 10 Black, the GoPro Media Mod, and the chin mount from chinmounts.com. The next thing we need is the GoPro helmet front mount. The GoPro Hero 10 front mount will click right into your chin mount from chinmounts.com. It has several connecting pieces that allow you to position your camera exactly how you want it. In my case, aligning the camera back instead of having it straight up gave the camera a better view of the road in front of me. Now as you are looking for this front mount, you will see other cheaper brands. I was tempted to save the $30, but in reading the reviews of the various off brands, it was common for people to be complaining about it being loose or breaking. So in an effort to minimize problems on the trail where there is no fix, I figured an extra $30 was well spent. So now that we have your GoPro Hero 10 Black mounted to the front of your helmet, we need an external microphone. You would think that an external microphone for the GoPro Hero 10 Black would be easy to find. There are several, but they're not always easy to get, and you may need an adapter for it to work. I ended up with the Drift Ghost 3.5mm external microphone, which is actually a microphone for another manufacturer's action camera. The specifications matched, and I figured that if it was good enough for the competitor's camera, it should be good enough for the GoPro Hero 10 Black. I did not use a dead cat or chin curtain, so there was a little wind noise when going 80 miles an hour, but on the trail, with the face shield up or down, it was excellent. Overall, the Drift Ghost did a great job. On a side note, many of these microphones need an adapter to work with the GoPro Hero 10 Black. You can simply look at the input and if it has two black rings, it will work, but if it has three black rings, you will need an adapter. which is also an extra point of potential failure and adds to bulkiness. I also recently set up another helmet and fell into the Purple Panda microphone pitfall and had overlooked the three ring input when I purchased it. It does come with an adapter, but it really messed with the GoPro and it did not record correctly at all. It gave me no confidence. While the Drift Ghost was basically seamless and I can plug and unplug the microphone, and record sound either directly from the Media Mod or the Drift Ghost helmet mic. The next item you may already have, but if you're in the market for adventure motorcycle helmet, there are several ways to go. My original goal was not just to purchase the most expensive helmet, but see if I could come up with a good middle-of-the-line helmet GoPro setup. My research led me to a Bell MX-9 Adventure. It is a relatively popular helmet with great reviews and is DOT rated, but it also has the MIPS system adding safety beyond just the DOT rating. I found the Bell MX-9 Adventure helmet to be a little louder, so I took off the stylish sun visor and it made the helmet much quieter and comfortable at freeway speeds. The MX-9 Adventure helmet has good airflow and a good airspace for breathing and microphone placement. It does not have a specific chin curtain part number, but the Drift Ghost microphone with just a phone microphone cover did very well at freeway speeds and great with the shield up or down when you are on the Idaho BDR. For optimum V-Log recording, a chin curtain and dead cat should probably be installed. Overall, the Bell MX9 Adventure performed very well. and probably worth a look if you're interested in helmets other than the Array XD4. So now we're on to SD cards, and the question always comes up, how long can you record with the GoPro Hero 10 Black? The GP10 can use up to a 512GB micro SD card, but I like to use the 256GB cards, so if something happens to one of the cards, you do not lose as much recording data. At a normal 4K recording setting on a 256GB card, you can record all day and on to the next. So you are pretty safe to get one 256GB card for every day of your trip. It is also a good idea to test the cards before your trip. and to have a container that can keep your new and used cards clean and dry. An Idaho BDR tip is to keep these cards in an easily accessible location so you can switch them in and out quickly and get back to writing. Also know that not all SD cards are the same, so make sure that you get ones that meet your GoPro's recording speed specifications. So now we're moving on to the external power for your GoPro Hero 10 Black. The external power supply is a requirement for recording all day and to keep your GoPro from overheating. The batteries I used were the 25,800 mAh portable charger power bank with USB out and micro USB in. This battery ran the GoPro all day with just regular on-offs. I never worried about how much battery was left. Now there was a reason I got the slower charging micro USB instead of the faster USB-C connector. With the newer bikes, they require more electricity to run all the electronics and to start, so a slower all-day charge is less of a draw. The idea is to charge the battery while you use the other. You do not want to charge this battery while your bike is not running for an extended amount of time because you will end up with a dead motorcycle battery, especially on the newer bikes. As mentioned before, the idea is to charge one battery while the other is in use. This can be accomplished in multiple ways depending on your bike setup. For me, it was easy to get a battery tender quick disconnect USB adapter and to charge one battery under the seat while using the other. Another Idaho BDR tip is to practice your charging routine with all your electronics before you are actually on the trail. Look to charge your heavier loads like your spare GoPro battery while you are riding, and your lighter ones like your phone and satellite communicator while the bike is stopped. Think of different situations and how to handle them, like if you stop a little early and the alternate GoPro battery is not completely charged. Can you skip charging your satellite communicator or phone for a day? Or do you just use the power bank until it runs out? One of the things I discovered was that it was possible to charge my phone and my satellite communicator at night from what was left on my external GoPro battery that I had used that day. Charging is at a premium, so be able to manipulate how you charge your equipment. So there you have it, an Idaho BDR GoPro Hero 10 Black setup that is solid and dependable. I had complete confidence and did not have to worry if I was capturing audio and video. Before your trip, however, make as many test rides as possible so you are familiar with how your camera starts and stops recording. With just a minimal bit of practice, this GoPro setup will seamlessly capture your vlog with just minimal intervention allowing you to focus and enjoy your Idaho BDR motorcycle adventure. We hope you found this podcast informative and helped you with your V-LOG setup. We hope to see you on the trail someday. Wizwear out."
    },
    "podcast_summary": "In this podcast, the hosts discuss how they set up their GoPro Hero 10 Black for the Idaho BDR. They provide a list of recommended equipment, including the GoPro Hero 10 Black with GoPro subscription, GoPro Media Mod, Bell Helmet MX9 Adventure (optional), chinmounts.com helmet chin mount, Drift Ghost 3.5mm external microphone, GoPro helmet front mount, portable charger power banks, SanDisk 256GB SD cards, Battery Tender Quick Disconnect USB Adapter, and various USB cords. \n\nThey explain the reasons for choosing the GoPro Hero 10 Black and discuss its performance on the Idaho BDR. They mention the need for an external power source to prevent overheating issues and highlight the different video format used by the GoPro Hero 10 Black, which may require a converter program for playback on older computers. \n\nThe hosts also emphasize the importance of the GoPro Media Mod for external power supply and microphone usage, the use of chin mounts for motorcycle helmets, and the selection of a suitable adventure helmet such as the Bell MX-9 Adventure. They recommend using 256GB SD cards for recording all day and advise testing the cards before the trip. \n\nFurthermore, they discuss the use of portable charger power banks for extended",
    "podcast_guest": {
        "name": "WizzWare",
        "job": "Podcast Host",
        "summary": "",
        "URL": "https://podcast.wizzware.com"
    },
    "podcast_highlights": "- Highlight 1 of the podcast: \"After a ton of research and hours of YouTube videos, I determined that every single action camera has one issue or another.\"\n- Highlight 2 of the podcast: \"If you unplug the external battery source, however, your GoPro Hero 10 Black will heat up and eventually shut down.\"\n- Highlight 3 of the podcast: \"The GoPro Media Mod is required for a motorcycle V-Log chin mount.\"\n- Highlight 4 of the podcast: \"The GoPro Hero 10 front mount will click right into your chin mount from chinmounts.com.\"\n- Highlight 5 of the podcast: \"At a normal 4K recording setting on a 256GB card, you can record all day and on to the next.\""
}