{
    "podcast_details": {
        "podcast_title": "Cahille Diyalog",
        "episode_title": "Otostopçu",
        "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/f20829a24fb0a6a1eaa8c35c97e23ff1.jpg",
        "episode_transcript": " Başla. Cahil introyu veriyorum. Evet. Merhaba insanlık, ben Cahil Keçisel. Aydınlanma yolculuğuma hoş geldiniz. Bugün stüdyomuz biraz kalabalık. Önce çırak olarak Berker. Bugün podcast kayıt aletinin başında. Sonrasında konuğumuz Ahmet İhsan Ongun bize... ...otostop anılarını anlatacak. En özelliğin şeylerden biri. Bir de Cenk. Sevgili arkadaşım Cenk burada. O da eski bir otostopçu ama bilirsiniz ki... ...şoförüm ve otostopçunun eskisi olmaz. Emeklisi olmaz. Bunlar her zaman... ...otostopçu ve... ...şofördür değil mi? Evet. Hoş geldin. Hoş buldum abi. İhsan mı Ahmet mi? İhsan. Nasılsın İhsan? İyiyim. Sağ ol abi. Sen nasılsın? İyi. Nasıl gidiyor hayat? Güzel gidiyor. Memnun musun? Çok. Ekonomi? Biraz. Güzel. Cenk, sen ne oldun? Ben aynı yani işte, bildiğin gibi. Aranızda kaç yaş fark var? Sen kaç yaşındasın İhsan? Ben 19 yaşındayım. Kaçlısın? Oradan diyor aşkım. Cenk'te 39 yaşında. Dörtlüyüm. Ben de dörtlüyüm. 20 sene farkla. Oğlum 20 yaş genç birisi yanında oturuyor ya. Çok acayip değil mi ya? Evet, böyle düşünücü hakikaten öyleymiş. Şaşırdım. Ben anlatsan yanında oturuyorum, karşısında oturuyorum ama beni o kadar etkilemedi 20 yaş genç olması. İkisini toplasak biz yapıyo. Ya evet yani bu adamın yani ne bileyim şu an bir hata yapsa, bir şey yapsa falan affetmemiz lazım. Mesela ne bileyim ağzından kötü bir şey çıksa. 20 yaşıcı ya yani ben o dünyaya geldiğinde 20 yaşındaydım mesela. Ben belki 19 yaşındaydım, sen 20 yaşındaydın. Ben 20 yaşındaydım. İlginç hakikaten. Onu kıyaslamak da hoş olacak şimdi otostop konusunu konuşurken. Ben şeyi merak ettim. 20 yaşında otostop çektiniz mi? Ben en çektiğim zaman zaten. Başka ne zaman çekecek? 20 yaşında çekiyordum. Kaç yaşında bıraktın otostop çekmeyi? Bilmiyorum ki aslında. Ama bayağıdır herhalde otostop çekmiyorum artık. Belki böyle İhsan seni gaza getirse çıkıp çeker misin? Ben Ilgın'ı gaza getirmeye çalıştım geçen Gürcistan'a giderken. Çünkü başınıza bir şey gelecek. Otobüs, minibüs saati falan böyle bir şeyler oldu falan. Bir saat boş boş beklememiz gerekiyordu. Ya gel dedim otostop deneyelim falan. Şu an var mı böyle karakacı otostop çekenler İhsan? Ben denk geldim Instagram'da. Var. Bazıları çekiyor. Çok tatlılar. Senin bir arkadaş çevren var mı otostopçulardan? Yani hepsi korkak. Bir iki kişiyi Cenk abi gibi ayarlayabilirsem yapıyorlar ben de izniyle. Yok normal arkadaş çevren dışında otostopçular sadece oturuyor. Hiç yok abi. Hiç yok. Öyle bir platform falan yok mu otostopçuların tanıştığı buluştuğu? Platform var. Platformlar var. Ama sen onlardan biliyorum da sen tamamen bağımsız bir şekilde kendi kendine özgür bir ruh olarak Spirit Eve'ye gidiyorsun, geziyorsun. Ben onları üç sene önce gördüm. Ha, üç sene sonra gördüm. Üç sene önce görsem belki katılırdım. Onlarla beraber gezerdim. Sen böyle bir platformlar olduğunu oto stop'a başladıktan üç sene sonra gördüm. Sen ilk nasıl başladın oto stop'a? Ben 16 yaşındaydım. Çok genç değil mi Cenk ya oto stop için? Tam yaşları ya. Çünkü garip bir cahil cesareti gerekiyor ya. Ben niye yapmadım madem cahil cesareti gerekiyor, adam cahil. Sende cesareti yok. Doğru. Evet nasıl başladı İhsan? 1000 kilometreydi, 1100 kilometreydi ilk otostop. Otobüs saatleri yoktu, o zamanlar Kahraman Maraş'taydım. Ailemin yanındaydım ve Bursa'ya dönecektim işte. Kahraman Maraş'ta mı yaşıyordun? Evet Kahraman Maraş'tayız. Hayır orada mı yaşıyordun? Yok Bursa'da yaşıyorum. Bursa'da yaşıyordun, oraya? Bursa'ya dönecektim. Ailen kahraman maraşlı mıydı? Hepsi kahraman maraşlıydı. Ben dönecektim tek. Tamam, sen Bursa'ya geri dönecektin. Bursa'dan kime dönecektin sen? Tek. Okumaya mı geliyordun buraya? Yok, o dönemler sporla uğraşıyordum. Spor için gelmem lazımdı. Şimdi kahraman... Hayır, Bursa'da mı yaşıyordun sen peki? Evet. Tek başına mı yaşıyordun? Hayır, ailemle. Anne baba sadece. Öbürü anneannem babaannem desen oğlum anne baba... Gerisi hepsi maraşlı. Ailem dersen önce çekirdek ailesi alıyordu. Haksız mıyım? Evet, evet. Ailem dersen karımla çocuğum. Dedim, Berker ailem derse annesi babası der. Cenk ailem derse karısından bahsetmez. Anne, ninesinden, delisinden bahsetmez. Çok görmedim zaten ya. İlgim yok yani. Aile kavramı pek oluşmadı bende. Çok karıştırıyorum yani. Ben mesela eltiği bilmem hala. Ailen işte. Birinci aile. En yakın şeyin eltidir. Birinci derecede yakınlık şeyin eltidir. Evet, Berker çırağımız olarak arasında düğmeleri bir bızıklıyor zaten. Ondan geldi. Çocuklar olur ya böyle. Sırf düğmelere basmak için gelirler. Buna basabilir miyim? Evet, şimdi sen ilk otostopundun. Maraş'a gittin, anneannenlerin yanına. Ondan sonra oradan Bursa'ya... Otostopla ilk kez dönecektin. Şahsi evine dönmek için dönecektin. Dönebildin mi? Dönebildim. Döndün, hani şu an burada olduğuna göre. Evet. 16 yaşındaydın. Nereden aklına geldi de 16 yaşında durduğun, ben kahraman Maraş'tayken... Dur bakayım Bursa'ya bir otostopla gideyim demek. O da şöyle oldu abi. Otostopu zaten ben şehirde yapıyordum da arkadaşlarla beraber. Hadi gidelim. Hızlı olur otobüsten ziyade. İşte Maraş'tayken de düşündüm. Otobüs saatlerine baktım. Hepsi dolu. Benim de o gün gidesim geldi. Bir uygulama var. Bilirsin. Bula bula kar diye. Oradan da baktım. Orada bir adam bana dedi ki ya dedi senin yaşında olsam dedi ben hani oradan Antalya'ya kadar otostopla gittim. Sen de dedi otostopla gittin. Ben de dedi tamam hemen. Hemen çıktım yani yola. Seni bula bula Karl'ı tanımadığın bir adam aracını almadı. Evet. Ve sana tavsiye verdi, otostopla git diye. Evet, çok güzel bir tavsiyeydim. Ben de dedim, hani nasıl yapabilirim? Bir de korkuda vardı mesela, 1100 kilometre, 16 yaşındasın, gitmen lazım. Aileme ufak bir yalan. Altı buçukta dedim, benim otobüsüm kalkacak sabahleyin. Altı buçukta önce Maraş'ta da olanlar bilir. Fiyaza diye bir AVM vardır. Onun önüne geçtim. Beş otostop Maraş'tan çıktım. Sabah altı buçukta. Sabah altı buçukta. Beş otostop yani beş araba değiştirek Maraş'tan çıkma beş araba sürdü. Evet. Bursa'ya gelmen kaç araba sürdü? Yani onun üzerindedir. Çok özgür ruhlu bir maceraya benziyor ya. Evet evet. Genel özgür ruhlu diyor zaten bana. 10 tane farklı insanla tanıştın. Evet. 10 tane değil. Mesela arabanın içinde 3-4 kişi de var. Onlar çok garip. Türk abilerimiz falan da var. Hatta onları yemek yemek için gittiğimiz yerde bile var. Bu gezgin tuttum getirdim diyor. Peki mesela o yemek yemeye durdu. Herhalde kamyoncular falan durmuşlar yemek yemeye. Aileler çok durmuyor. Aileler de duruyor ya. Sana yemek ısmarladılar mı? Evet. Paran var dedim inanmadılar. Yolda olduğumu görünce beni parasız zannediler. Paran varsa bile 16 yaşında bir çocuğu, bir de misafir, tırcılar, kamyoncular yanındaki adamı yiyip içirilermiş. Evet, evet. Öyleler. Gerçekten. Benim arkadaşım da vardı. Askerden gelince böyle dedim, beni biraz gezdir. Biraz gez dedi kamyonun ucuna da. Biz dedi yediğin, içtiğin yanına kar kalır. Çok güzel bir şey değil mi? Kural değil mi? Bir de kamyoncular yemek yiyorlar ya. Onların tesisleri falan, onların çok takıldığı yerlere biraz ayrı oluyor. Orada mesela kesinlikle çay parası vermiyorlar. O işte içtiğimi bilmiyorum. Bilmiyorum o kadar. Ne kadar çay içerse içsin, kamyonun çay parası vermiyor. O tesis ona alışkan oluyor. Ama değişmiştir o ya. Çay 5 lira, 10 tanesi 50 lira yaparız. Evet. Değişmiş olabilir. Sonra geldin Bursa'ya. Bursa'ya geldim. Evdekileri de söylemedin böyle böyle. Yok. Bir yıl sonra söyledim babama. Ne dedi babam? Aferin dedi. Aferin. İyi halt yedin aferin. Yoksa aferin oğlum. Sen de gurur duyuyorum. İyi halt yedin. İşte benim oğlum. İyi halt yedin dedi. Peki senin Cenk ilk otostopun? İlkini bilmiyorum da dönemdi. Önce şehir içinde çok çekiyorduk biz. Onu saymıyoruz. O zaman şehirler arası... Bir dönem böyle şeydi bizim müzisyen tayfa var ya işte Uğurlar falan sen de görmüşsündür. Onlar cuma akşamı Bursa'da, cumartesi akşamı Eskişehir'de, pazar akşamı Ankara'da çalıyorlardı. Biz cuma akşam bunların... Kaç yaşındaydınız? Herhalde 18, 20 falan. Cuma akşam bunlar Brussel'da çalarken biz bunlarla buluşuyorduk. Sonra biz Eskişehir'e otostopla gidiyorduk. Önden bir grup. Böyle bayağı grup fanı gibi. Ama hiç de ne konserlerine gidiyoruz ne bir şey yani orada. Onların oradaki imkanlarından faydalanıyoruz. Onların otele hangisiyse biz otele onlardan önce gidip çöküyoruz. Ya da işte evse eve. Ondan sonra biz orada takılıyoruz genelde. Onlar Ankara'ya gidiyor, geri geliyor. Biz yine Eskişehir'de oluyoruz. Sonra taa bir sonraki Bursa'ya kadar orada Eskişehir'de takılıyoruz falan. Bazısında Ankara'da bir hafta takılıyoruz falan gibi bir hayatımız vardı. O süreçte de sürekli o araların hepsini otostopla geçtik. Baya da fotoğraflarım varmış şimdi onların varlığında. Sen tek başına otostop yapmadın o zaman. Tek hiç yapmadım herhalde ya. Hep birileriyle yaptım. Yurtdışında falan da tek yaptım hiç hatırlamıyorum. Yurtdışında da yaptın sen. Yaptım. En havalımda Bülüksel'den Amsterdam'a yaptım. Hatta o fotoğrafı aradım da bulamadım. Böyle fotoğrafım var elimde Amsterdam yazan bir etiketle. Hayallerimizi yaşamakla meşguldün. Çok da değişik bir adam. durmuştu otostopta. İngiltere'den geliyormuş. Amsterdam'da gece kulübü varmış. Bizi gece kulübe davet etti. İngiliz miydi? İngilizdi. Amsterdam'daki sadece bir yatırımmış. Her cuma akşamı oradan işte bir sürü de kilometre baya da yol yani 10 saate yakın yol diyordu arabayla geçmesi. Her cuma da geliyormuş. Her cuma geliyorum diyor, eğleniyorum. Bütün hafta sonu Amsterdam'da diyor. Pazar akşamı çıkıyorum. Tekrar pazartesi İngiltere'de işimin başında oluyorum dedi. Her hafta sonu Amsterdam'a eğlenmeye gelen... Çok affedersin de İngiltere'den Amsterdam'a nasıl gidiyor arabayla? Bilmiyorum. Köprü var mı İngiltere'den karşıya? Köprü yoksa da feribot vardır. Arabalı feribot. Bir bağlantı vardır yani kesin. Kendi arabasıyla. Ama zızı zaten bağlı değil mi ya orası? Cahille diyaloğa hoş geldiniz. Bir daha yap. Evet İngiltere. Arkadaş açınca haritayı tamam mı? Bir kere hiçbir şey bilmiyorsan Age of Empires'te bilmem neler oyunu oynadıysan her konuda cahil olsam da İngiltere'nin bir ada olduğunu Yani babam da böyle diyeceğim de babam daha çok bu işleri bilir. Bu işleri bilir dedim yani. Otostop'u. Yok, haritayı. Coğrafyayı bilir. Sen yurt dışında çıktın mı hiç? Yok. Türkiye'de hep otostop yaptın. Çok halim var. Yurt dışına çıkmak da o daha nasip olmadı. Yaşın çok genç ya çıkarsın. Gürcistan'a git. Herkes aynı tarzıya veriyor mu? Evet evet başlarken öyle. Bana da öyle diyorlar yurt dışına çıkmak istiyorum deyince Gürcistan'a gidiyorlar işte. Böyle pasaport dahi olmadan seni bir yere alan bir yerde bana yurt dışıymış gibi gelmiyor işte. Bana göre geliyor ya hani ne bileyim pasaport şart mı sence? Şart. Yani kimlikle girebildiğin bir yer. Yurtdışı değildir. Bravo. Berker soy ismi neydi? Kalyoncu. Yurtdışı pasaportsuz girdiğin yer yurtdışı değildir. Berker Kalyoncu. Söz. Bravo. En uzak gittiğin yer Maraş mıydı? Evet. En son nereye gittin? En son İzmir'den geldik. Hangi ay? 3-4 ay önce olması lazım. O nasıldı mesela son gelişin? Son gelişimde hani herhangi bir gezmek için gitmemiştim. O zamanlar bir şirkette distribütörlük yapıyordum. Güzel güzel. Bu yaşlarda denilebilir bunlar ya. İki tane şirkette çalıştım aynı zamanda yani. Bir sektörde iki tane farklı. Bir de şirket değiştirdim yani. İş görüşmesine falan gittim. İki üç kere antrenörlükte falan. Çok güzel anlarım oldu yani. Erken yaşa kadar. Çok mutluyum mesela o şeylerde. Bu yaştan sonra da biraz da sakin yaşarsın artık. Evet. Şimdi ikinize de sorayım ama şeyle başlayayım bir güvenlik problemi yaşadın mı hiç otostop çekerken nasıl yani ne bileyim işte başına bir olay gelmesi Ya ben ekstra biraz rahat bir insanım. Dayak. Yolun ortasında atma. Paranı alma. Yok. Cüzdanımı telefonumu arabanın içinde bırakıp markete giden bir insanım. Adam arabanın içinde... Öyle güvenirim yani ben insanlara. Bravo. Öyle bir şeyim olmadı yani. Cahil cesareti diyebiliriz. Evet bende yok mesela bu. Bırakmam telefonumu telefonumu. Tam tersi çok fazla para veren oldu. Türkiye'de mi? Türkiye'de Türkiye'de. Yurtdışında ben bir tek şeyde Arnavutluk'ta çok büyük sıkıntı yaşamıştım. Ne yaşadın? Orada çünkü şey yapmıyorlar. Para istiyorlar. Yani otostopun otostop olduğunu bilmiyorlar. Nasıl yani parmağını kaldırdım diye bedava arabaya mı bineceksin falan gibi garip bir şey var anlatamadık. Baya da uğraştık. Bir iki kişiye para ödemekte zorunda kaldık. Hadi ya. Biraz serplerdi çünkü. Parasını ödeyelim de kurtulalım. Yoksa daha kötü şeyler yaşayacağız diye. Öyle sıyrıldık. Avrupa'nın göbeğinde? Arnavut'a mı onlar? Yani. Aynı hırzınları da. Çok Avrupalı sayılmazlar. Bursa'da da Arnavut mahallesi var. Zafer Mahallesi'ne git. Otostop çek. Para almazlar senden. Tabii. Buradan Zafer Mahallesi meşhur mahalledir. Buradan gir, işte karşılarlar seni hoş geldin derler. Çayını içerler, dayağını atarlar, gönderirler seni oradan. Bu arada o fotoğrafı doldum bak ne kadar çirkinmişim. Ya Allah'ın yarattığı kulaşım, çirkin denememiz Allah'ın gücüne gider. Bir şey düşünmüş, yaratmış seni o şekilde. Ama Allah'ın yarattığı insana biraz müdahale etmişsin ya. Bu kart şeyi çok güzel ya. Yazıyorlar Bursa İstanbul'da. Sen yazıyor musun? Yok ben yazmıyorum. Niye yazmıyorsun? Üşeniyorum ya. Onu tutacağım kaldıracağım. Sen çok özgür ruhlusun lan. Evet. Vallahi helal olsunlar. Keşke ben de öyle bir çocuk olsaydım. Ben vizyonsuzum ya. Cenk, sen 18-19 yaşlarında... Bu Avrupa'ya kaç yaşındaydı sen? Bu da işte 20 falandır. Ay arkadaş ya. Benim hiç kafam çalışmadı ya. Bir senem kaldı. Ben 20 yaşında benzinlik marketinde çalışıyordum. Sen anasının en azından Antalya'da, Mallon, Antalya'da çalış. Ne olacak yani? Benim ilk çıkışım da tamamen otostopla gezmek üzerine kurudu. Yani en başta öyle değildi hayal de. Interrail'de gidecektik. Son anda vize alamadığımızı öğrenip tren biletini iptal ettik. Sonra bir internet kafaya gittik. Türkiye'den vize istemeyen ülkeler yazdık. Makedonya'yı gördük. Oraya uçak bileti aldık. Sonra Makedonya'nın etrafında otostopla, Arnavutluk, Kosova, Karadağ böyle dört ülke gezdik. Hepsini otostopla yaptık. Bak bunun güvenlik anası olmuş. Para istemişler, arzular döveceklermiş falan. Anlattı ya şimdi. Telefonda oynuyordun orada. Dedi ya Anıl'ın otostop çektiğinde para istediler. Hayır ama o güvenlik değil. Bir çalıntı malıntı da olmamış. En azından para istemiş. Bunu istemiş yani. Tamam. Yoldaki gaspçı da senden para istiyor. Ya gaps... Gaps mı? Wink wink wink wink yap. Wink wink wink yap. Konya'da vardı bir tane benden para isteyen. Kırşehir'den ben çıkmıştım. Konya'da işte bir 100 kilometre miydi 50 kilometre miydi var. Hiç araba yok ama. Geldi kapıyı açtım tam bineceğim dedi 100 liram var mı? Abi dedim 100 liram yok. Bir de oraya kadar bedava gelmiş. Benim inadım bedava gitmek istiyorum. Gurur bir de böyle gurur yapacağım diyeceğim bedava gitmek istiyorum. Bilmeden önce istedi senden. Evet evet tam binecektim işte. Dedi 100 liram var mı? Yok abi dedim. 50 liram var mı? Arkama baktım hiç araba gelmiyor. Yani mecbur orada kalırım 50 lirayı vermezsem. Var abi dedim. Sonra Bıla Bıla Kara biri söylemiş ona. O da diyor ki işte böyle bir uygulama varmış giderken. Otogalerici bir de. Ekstra para da yapmak istiyor. Ben gittim adama bla bla karı yükledim. Ondan sonra gideceği güzel rakları yazdım. Bir tane de müşteri buldum. Ondan sonra adamın arabasından ayrıldım. Şunu da aklıma geldi. Keşke deseydim. Abi benim paramı geri verir misin? Ben sana dedim müşteri buldum filan. Demek sonradan geldi aklıma. Adam helal olsun ya. Bir de galerici ha? Evet evet, araba götürüyordu işte onu da. Sen de Konya'dan, senden Kırşehir'den mi Konya'da mı? Kırşehir'den çıktım, Konya yolunda. Konya'ya doğru gidiyorum. Konya'ya doğru giderken biri seni param var mı diye sordu. 100 lira yok dedin, 50 lira var deyince arabayı aldı. Sonra dedi ki ben bu işten nasıl para kazanırım? Ben otogalericiyim dedi. Evet. Otogalericiyim dedi. Sen kaç yaşındaydın o zaman? O zaman 17. 17 yaşında çocuklar 50 lira parası almış. Eğer bizi buradan dinliyorsan, eğer bize de öfke duyduysan yerimiz yurdumuz belli. Çok meydan okuyorum burada insanlara. Yine bir iyi bir insandı. Niye iyi olsun canım? Olsun yani. Çok parayı seviyor demek. Yine bir sevgisi var yani. İyi ise cennete gitsin ne yapalım. Bravo. Peki hiç böyle otostopta bindiğiniz arabada aşık oldunuz mu? Yok ben aşık olmadım. Şöyle söyleyeyim. Bindiğiniz bir arabaya tamam mı? Bir aile arabası işte. Station wagon falan. Adam aldı sizi. Siz yaşlarda bir kız var. İşte benim kız da şurada okuyor falan dedi. Bir bakıştınız, gülüştünüz. Tek konuşmadınız ama... ...işte böyle dikiz aynasından falan bir yerden görüyorsun. Çok tatlı böyle... Kıyaman bir kız. Böyle aklınızda kalıp, böyle platonik... Bu da bizim yılların şeyi herhalde ya, 90'lı yılların değil mi? Bu yaştan yiyorsun. Çaktırmadan, Instagram'dan böyle... Foursquare'den falan bulmaya çalışıyorsun. Adam Sandler filmi değil mi abi? Hangisi? İşte bir tane... Yolculuğa çıkıyorlar da... Karavanlı bir yolculuğa çıkıyorlar. Bilmiyorum ya. Aşık oluyor falan. Öyle biliyorum. Çalıntı bir senaryo değil yani. Kendi aklıma geldi az önce. Cenk senin baba var mı? Yok ya ben de düşündüm sen söylerken ama. Peki aşık olmaya en yaklaştığınız an oldun böyle. Hani bir kızı olmazdı mesela. Şoförün kendisi çok iyi bir insandır. Benim Lüüfer bölgesinde bir tane var aşık oldum. Onun dışında konuşmak istemiyorum. Senin sevgilin var. Evet teşekkür ederim abi sağ ol. Selamı göndermek ister misin? Yok istemem yani şu anda. Közümle müzik vereyim abi istiyorsa. Ama isim vermeden gönderebilirim. Mecbur değilim. Herhalde değil mi? Niye mecbursun? O zaman aşkım çok selam gönderiyorum sana bundan. Aşkım sana selam gönderiyorum demek. Çarkı feleğe mi katıldın? Seni seviyorum falan da var ya. Bir daha gönderebilir miyim? Seni seviyorum da. Seni seviyorum. Ama yanlış yerde giriyor müzik ya. Bir daha yapalım. Ya oğlum adam çırak ömrüne ilk lafı odurmuş olacağı o kadar. Bu arada abicim bak bu çocuk seni hakikaten seviyor. Ben çünkü sesinden anladım seni seviyorum derken. Sesinde böyle bir o, bir utangaçlık, bir ses titremesi gerçekten sevginin verdiği bir hissiyatın tezahürü vardı gerçekten de. Senin mi manitem var mı Berker? Yok. Seni seviyorum da bakayım birine. Sana diyeyim mi abi? Yok. Cenk abi neden? Cenk abi seni çok seviyorum. Bunu da ses getiriyor. Ama ben içten sevgili bir çocuğum zaten yani. Sevgiye inanıyor musunuz? Çok inanıyorum. Zaten benim uzun bir ilişkim oldu. Yaşım küçük ama. Ne kadar uzun? Altı yıllık. Kaç yaşındasın? 22. Ben sana soruyor muyum? Bir sevgilim var mı diye. 22 ilişki. Altı yıllık ilişkisi olunca kaç yaşında şey yapmış olacaksın? Geçen sene ayrılmış olsa 15 yaşından beri. Liseden beri. Onuncu sınıftan beri. Vardı bir şeyler. Benim kaç senelik ilişkim var biliyorsunuz bu? Podcastleri dinlemediniz siz. 15 15 yıllık ilişkim var 7 yıllık karımla 8 yıllık da sevgilimle toplam 15 yıl çok güzel ya onları toplayabilir miyim? tabii toplayabilirsin farklı farklı kadın olsa bile toplayabilirsin istersen aynı kadın o zaman kesin toplarsın zaten aynı kişi ise tabi abi Evet. Neler konuşuyoruz biz böyle? Başımıza bela açmak için. Konu konudan çok uzaklaştık. Otostop diyorduk. Ben bir şey sorayım mı? Lütfen ya, siz de birbiriniz. Benim hiç anlamadığım konular ya. Böyle eski Türkiye'de çok güzel şeyler vardı, insanlar vardı. Hala var mı? Biz mesela Bursa'da otostop çekiyorduk. Ankara'ya gideceğiz. Adama Eskişehir'e kadar gidecekse bizi Eskişehir'de otogara bırakıyordu, otobüs biletlerimizi alıyordu. Hadi iyi yolculuklar deyip Ankara'ya kadar gönderiyordu. Öyle insanlar kalmadı mı? Denk gelmedim hiç öyle. Maddi şeydendir şimdi. Bunu ben de yapmak isterim ama alamam yani. Tamam 50-100 lira veririm de. Otobüs bileti ya buradan Trakya'ya kaç para ya? 700 lira mı ne? Şu an işte zaten. Babaeski Hanım memlekete. Adam o zaman yapıyormuş. 1000 lira yani. Evet evet alım gücü yüksekti insanların. İnsanlar da geçmemişler de o paraları yetmiyordur. Şey diyen vardı ama gel beraber yemek yiyelim bugün bende kal dinlen ondan sonra yola çıkarırsın geri ben seni bırakırım buraya falan diyenler çok oldu. Ama hani biletini alayım git. Kaldın mı hiç bir tanesinin evinde? Yok. Ya kalmadım. Tehlikeli değil mi? 16 yaşında o kadar da özgürlüğümde olmayayım dedim. Evet, evet. O sonra olur dedim. Doğru düşünmüşsün ki bugün aranızdasın. Evet. Gerçekten hani şimdi buralı insanlara yanlış örnek olmayalım da ben mesela benim yaşımdaki 38 yaşında biri için bundan cesaret alıp yola çıktığımda hakikaten kötü şey yaşama ihtimali çok düşük mü ya? Bence düşük. Bence de. Peki 38 yaş geç bir yaş mı bunu denemek için? Hayır canım. Neden, neden var? Bu değişik yollarda var ya biliyor musunuz onu? Youtube kanalı. Bilmiyorum. O da böyle baya geç çıkıyor aslında otostop'a. Hani 38 değil tabi ama 30 vardır yine. Ya 38... Sonra da dünyayı geziyordum. Yaşında hiçbir şey yapan yok yani gördüm. Emekli olanlar falan var. Yok ya, karavanlılar falan var. Ya podcast şey oldu ya hafta sonu oraya geldim işte Berker'le Ahmet İhsan'la da orada tanıştık. Orada Özcen Abi bir tane kadın vardı yaşlı. Özcen Abi vardı yaşlı. Ondan sonra en yaşlı bendim. Benden daha yaşlı yoktu. En büyük bendim Özcen Abi ile Zuhal Hoca galiba. Felsin Mert miymiş? Yaşın kaçtı? 30? 38. Benim de 38 ama bizim arabamızda bir yaş var nasıl oluyor? Sen çünkü bir şey erken söylüyorsun. Yaş küçültüyorsun kendini. Öyle bir matematik yapanlar var da. Kasım ya ondan. Fark eder. Çıkartacaksın yıldan yılı. 2000... 2000 kaçtayız lan biz? 2023. 2023'den 1984'ü çıkartacaksın. Ben de 1985'ü çıkartacağım. Bunları toplayıp ikiye böleceğiz. Ortalama yaşımız bu. Bence değil. Ortalama yaşımızı alırsak ama aşağı doğru yuvarlama tekniğiyle aynı yaşta oluruz. Orada ise bak sen aklı çıktın. Kendin mi çürüttün? Görüyor musun? Ya ben böyle hayal ettim ama. Dostostopu diyorum ya. Ben gençken falan vizyonsuzdum biraz. Bu yüzden ben belli bir süredir Z kuşağını takdir ediyorum. Çünkü Z kuşağın aklında koyduğu şeyi bir anda aklına geliyor ya Cenk. Hemen yapıyorlar. Podcast yapacağım diyor. Yapıveriyor yani. Bir şey YouTube deneyeceğim diyor. Yapıyor. Olur, olmaz. Ama abi fırsat çok önemli ya bence. Evet. Hani bir fırsatın çıkması. Mesela atölye benim karşıma özcede yürürken çıktı. Panoda. Panodan gördün mü? Aynen panodan gördüm. Dedim hemen başvurmalıyım falan diye. Podcast gibi dijital dünyanın uzay çağının şeyi de... ...risk, püskü, en ilkel reklam yönetimi olan panoda görünmesi de... Garip abi, aynen. Ama var ya çalışıyor, ne yapacaksın? Evet, bak adam görmüş oradan. Abi senin çocuk kaç yaşındaydı? Beş aylık. Abi senin var mı? Yok abi. Bilgi çok kolay oldu ya. Bilgiye ulaşmak, erişmek. O yüzden de kafalarını koyduktan çok rahat yapabiliyorlar. Ya muhakkak etkisi vardır. Bu... Peki, bir soralım. Senin var mı hiç... ...otostopçu, anın otostopçu tam çekmedin ama belki almışsındır? En bayıldığım şey... ...böyle var ya, otostop için durup geri girecek kilometre gidelim. Hadi be. Peki, hiç böyle tipine bakıyor musun? Hiçbir şeyine bakmıyorum. Ne olursa olsun alıyor musun? Hiçbir şeyine bakmıyorum. Ben çekiniyorum biraz da. Üstü üstü pisti almıyorum. Yok yok, ne olursa olsun alıyorum. Ama mesela belirlediğim... ...şeyler var. Bir tane deli var... ...şeyde, bizim evin oralarda, geçtiğim köyde. Yeni taşınmıştım. Arkadaki köy yollarından geliyorum Bursa'ya. Buradan yolun arkasından çıkıyorum. Bursalı olmayanlar bilmez. Orada bir köyde bir tarlanın başında bir tane amca oturmuş. Yanında böyle bir köylü sepeti var, bir tane de kov var, bir tane de çuval var. Dedim herhalde tarlasına çalış, bir yere gidecek ya da pazara götürecek, bunları satacak falan. Herhalde üstü başına tarlada kirlenmiş diye düşündüm. Ondan sonra ben adamı durdum. Adamı durdum, aldım bagajı açtı, eşyalarını falan koydu. Yanıma oturdu, dedi ki ben savcıyım. Ben ona tabi o adamın deli olduğunu anladım. Bir savcı olmasından. Sonrasında bu adamla gittik işte. O mudanya köplüsünü orada bıraktım onu. Bagaj indirirken yardım ettim. Bagajın içinde bir çuval dolusu... ...telefon vardı. Ev telefonları var ya, eski ev telefonları. Döndürmeli. Onlardan. Döndürmesiz. Döndürmeli olsa para yapar anasını satayım hani. Eski bisiklet diye de. Ya en böyle mantıksız şey... ...çıktı. Boş... ...kaset kapları falan vardı. Kasetin içi yok da kabı falan var. Deli olduğunu biraz daha tescilledim ben bu adamın. Dedim bu adam deliymiş. Ondan sonra bizim şey var ya Fikriye, o hasköylü ya. Bilir böyle. Aa altın taş delisidir o deli. Tamam dedim. Ondan sonra aradan zaman geçti. Kış, hava yağmurlu ve çok soğuk bir hava. Bizim evin açısında bir market var ve dimdik bir bayır var. O dimdik bayırdan zorlu çıkan bir adam gördüm. Durayım dedim şunu da götüreyim. O aynı savcıymış yine. Arabadan indim bayırda. Bak hava soğuk, kış, buz gibi arabadan iner inmez adamın kokusunu aldım. Öyle kötü kokuyor ki adam. Öyle kötü kokuyor ki. Neyse bunun çantası ıvır zıvırını yine bagaja koyduk. Amca dedim öne oturma koltuk bozuk. Arkaya geç. Camları mamları açtım. Kendi kafamı biraz camdan çıkardım. Bir de pandeminin son demleriydi. Arabada bulduğum iki üç kat maskeyi ağzıma taktım. Köye götürmemi istedi kendisini. Savcı olduğu için adamı itiraz edemiyoruz. Adamı köye kadar götürdüm. Yani böyle 5 kilometrelik falan bir yol. Yoktur öyle. Evinle bıraktık. Ya var ya bizim arkadaş var Erkan. Biz onun zamanında bazı işleri oluyordu ben askerden önce işe başlamadan falan. Şehir dışına falan giriyorduk. Balık kesire falan. Orada bir tane deli bulmuştuk. ...deliği alıp, işte... ...5 kilometre ileride köy var, oraya gideceğim demişti. Biz de böyle... ...200 kilometre falan beraber gelmişti. Burada inmeyeceğim, burada inmeyeceğim. Biz otele varmıştık, otele falan gelmek istemişti de... ...biz hani kabul etmeyince... ...yani... ...böyle bir imkanımız yok. Şeye bıraktık. Garaja bırakmıştık. Beni geri götürün. Ondan sonra o adam deliymiş. Geziyormuş güney marmarayı böyle. İnegöl tarafında bulmuş arkadaş. Kokusundan tanıdım diyor. Delilerin kendine ait kokusu oluyor ya. Yani hepsinde ayrı kokusu var büyük ihtimalle bizim arkadaş tanığına göre. Bir de bizim Erkan biraz çılgındır. Böyle işte soğuk havada deniz yemenize girer. Sanırım şeydi... Nisan ayıydı. Bir de o Çanakkale tarafları, Balıkesir tarafı da soğuk oluyor ya deniz. Böyle bir yerde yol yanında durdururken ben denize gireceğim diyor. Tutturdu böyle şortunu, mortunu yiyor. Deli de diyor ki, böyle denize girme bu havada. Deli derler insanı. Sonra... Bu adam bize balık kesirden devam ediyor. Biz nereden zannettik? Hatırlamıyorum şimdi. Çanakkale'den balık kesir mi? Balık kesir mi? Çanakkale'ye mi? Bir Bursa vardı. Bursa'ya doğru gidiyorduk. Neyse öyle bir şey. Behram kaleye gidelim dedim ben. Behram kaleye gittik. Ben Behrem Kule'de, haber derseniz Diyare oldum. Varsaklarım bozuldu. Koca koca bir tane şey buldum. Abi Diyare ne demek? İshal. Halk arasıyla. Cürcür. İshal arasında İshal. İshal oldum ben. Tuvalete girdim böyle 20 dakika yarım saat tuvalette vakit geçirdim. Deli ile Erkan bütün asosu gezmişler. Sevgili gibi çıktım. Baktım bunları böyle yan yana yavaş yavaş konuşa konuşa geliyorlar. Sonra bindik arabaya bıraktık. Yani bu deli konusunda Erkan daha tecrübe. Çünkü o deliyi daha sonra da dengetirmiş ilk kere. Erkan'ı aradım. Dedim böyle böyle. Deli bindi benim arabaya. Çok kötü kokuyor. Ne yapayım dedim. Aç camları. Dört camı da. Hızlı bir yolda git dedi. Oradan ana yola çıktım işte. 15-20 dakika araba kullandım. Sonra eve gittim. Manca kokusu çıktı. Sonra adam hala daha işaret yapamıyorsa onu almıyorum artık. Şey de garip. Adam otostop çaldı mı diye sorduk. İki tane deli aldığından başladı. Buradan bir genelleme yaparsak bütün otostop bize deli olacak. Hiç... Aklı başında insan gibi denk gelmedi mi otostop? Geldi. Şeyde... Trakya'dan dönerken... Aldım. Bir tane roman vatandaş. Uzun köprüye gidecekti. Uzun köprü rock roman var. Bir yazdı. İşte böyle... 30 kilometre falan önceden aldım ben onu. Muhabbet, sohbet gittik. O kadar hasretim ki insana. Adam muhabbeti o kadar tatlı geliyor ki bırakmak istemiyorum böyle. İşte gidiyoruz, ya sen beni uzun köprüye girişte bırak diyor. Yok yok diyorum ben seni götürürüm abi şehrin içine. Şehrin içine gidiyoruz. Ya diyor mahalle kadar gitmene gerek yok diyor. Ya götürürüm ne olacak ayıp ediyorsun. Düğüne gidiyormuş adam. Ben de bekliyorum ki roman ya bunlar. Ben diyorum çağır roman düğünü, orada bir şey yaparım falan. Değişik bir anı olur falan diye. adamın kapının önüne kadar bıraktım, adam tadı bile kaçtı böyle. Ben aslında o gün bula bula kardan şey yapmıştım. Bu bula bula karlara bip koyarım herhalde ya. Bula bula kardan ilan açmıştım. İşte böyle, gelen binsin diye. Kafamda hesap ediyordum işte. Bir kişiyi alırım, muhabbetçi olsun yeter. Ondan sonra işte... Ama iki arkadaş bilmek ister, o da olabilir. İşte kız erkek alırım işte. Bir kız bir erkek alırım. Şey olur. Hani iki erkek zaten alırım, bir erkek zaten alırım. İki kız da olabilir aslında. Hani onunla o biraz dengeler şey. Ama tek kız alamam şimdi. Karım kızar. O kadar yol... ...gitmek dizdize. İki kızla mı abi kızar? Yok, tek kızla. Yani kafamda öyle bir hesap yaptım. Tek kızı yanımda oturtup o kadar yol gidersem... ...ondan sonra... ...başıma o geldi. Bir kız tam yolumun üstündeki bir köyden... ...yeri ayırtırmış. Telefona bakıyorum. Kıza bakıyorum, yahu diyorum... Nasıl hayırdır? Nasıl olacak bu iş? Ne yapacağım? Ne edeceğim? Böyle bir kalkka atmaya başladı. Sinirim bozuldu. Karı soruyor. Ne oldu? Ne oldu? Ya dedim. Böyle böyle yalan söylüyorsun. Ya dedim bak. Böyle düşünüyor şimdi. Ya şimdi ne bileyim? Öğrenci midir? Diyor. Öğrencidir herhalde. Allah Allah. O da vicdanı şey yapıyor bir taraftan. Ya diyor. Ben senin kıza asılacağını düşünmüyorum. Kızın da sana asılacağını düşünmüyor. Ama sen o yolda öyle bir iyilik meleğine dönüşeceksin ki, diyor. Bütün yol boyunca. Parada almazsın, ödersin de evine bırakırsın, bütün böyle şeyini gösterirsin, bilmem ne yaparsın. O hareketlerim beni sinir edecek, diyor. Birliğin fazla iyiliği. Arabada gidiyoruz böyle, hanımla. Yan yana oturuyoruz. Düşünsene böyle diz yüze gideceksin diye gece yarısı o kadar yolda. Ben de vitesleşecekken masum hanımın bacağını sürttürüyor. Böyle olacaktı. Sonra ne yaptım sizce? Aldın. Hayır. Yolculayıp tuvalet ettim. Bir de hakikaten gitmedim yalancılık olmasın diye. Bir gün daha kaldım. Tam yine gelen polmasın diye gitmemiş hiç. Süper ya. Ama seviyorum ya. Alırım yani hiç korkmam. Hele şehir içinde falan var ya. Bir kere hava kararmış. Bursa Termini'nin arkasında, arka köy yollarından o zamanlar... Daha Termini'ye yakın oturuyorum, Yunuseli'ye bir 10 dakikalık yollar. Oraya gideceğim. Bir adam o sop çekiyor. Ama nasıl izbantut. Üst dubası kirli böyle ama... Ben şey anlıyorum, bu adam işçi hani böyle... Yağ falan var üzerinde, araba tamirisi falan ya öyle bir şey. Ya da fabrikada çalışıyor. Korkunç! Adamın yüzü falan. Bir de kendim de şeye giriyorum. Diyor ki ben bu adamı alayım yani. Ben korkak biri değilim. Bu adam bir şey yapamaz falan bana diyorum. Bir de ben düstur olarak arabada hiçbir kimseye zarar verici alet bulundurmuyorum. Uzun süredir zarar vermeyeyim insanı diye. Aldım onu. Adam diyor ki ya o kaç saattir buradayım. Ne kadar zamandan beri bekliyorum. Kimse almıyor arkadaşlar. Nasıl işliyor? Abi, yanlış anlamadım. İnsanlar korkuyorlar bizim yeri yarısını. O yüzdendir dedim yani. Ben dedim korkmuyorum. Şahsen aldım seni adama da korkusuzluğumu ifade edip bana bir şey yapmaya kalkarsa, o adam korkusuz, ben buna bir şey yapmayayım desin diye. Şehir içi çok alıyorum. Her nedeni alırım. Tanıdığım bildiğim, kokusunu bildiğim bir deli değilse alırım. Böyle yeterli cevap oldu mu? Evet. Biraz kısa oldu ama. Yok yok güzel oldu. Kaç dakikamız oldu acaba? 33. Ne dersiniz? 33 güzel bir sayı bence. Bence de. İnsanın dudakları böyle büzülüyor söylerken. Benim bir iki anım daha var da yeniden anlatamayacağım anılar. Program bitince anlatırız. Tamam kapatalım bunu. Uzun basıyorum. Dur. Veda ederim ya. Evet insanlık. Bu program 4 kişilik. Berker, ...kayıt masasına şık şık şık şık yapma oğlum, bas bir şeylere. Şöyle bir şey vardı. Anı konuğumuz Ahmet İnsan Ongun. Ve... ...Mülüfer Belediyesi'nde değerli... ...Dijital Stüdyo'nun... Şefi Ali Cenk Algün bizlerleydi. Hoşça kalın. Oğlum bu ne? Çeko gibi o bağım kere bastın. Ben adını söyleyeceğim. Basyan alkışlayacak. Kapatacaksın. Ben adını söyleyeceğim. Basyan... Ya kapat senden. Hiçbir şey olmadı. Bak nere basıyor ya? Hadi hoşça kalın insanlık."
    },
    "podcast_summary": "In this podcast, Cahil Keçisel and his guests discuss their experiences with hitchhiking. They share stories of the interesting people they've met and the adventures they've had while hitchhiking across different cities and countries. They discuss the freedom and excitement that comes with hitchhiking, as well as the safety measures they take. They also touch on the importance of trust and connection between hitchhikers and drivers. Despite encountering a few unsettling situations, they emphasize that hitchhiking can be a rewarding and memorable experience.",
    "podcast_guest": {
        "name": "Ahmet İhsan Ongun",
        "job": "otostopçu",
        "wiki_title": "",
        "wiki_summary": "",
        "wiki_url": "",
        "wiki_img": "",
        "google_URL": "https://www.ivoox.com/otostopcu-audios-mp3_rf_114072072_1.html"
    },
    "podcast_highlights": "- \"Otostop çekerken en çok sevdiğim şey, farklı insanlarla tanışmak ve onların hikayelerini dinlemek oldu.\"\n- \"Otostop yaparken her zaman açık olmak ve farklı deneyimlere cesaret etmek önemlidir.\"\n- \"Otostop çekerken, bazen beklenmedik yardımlar ve misafirperverlikle karşılaşabilirsiniz.\"\n- \"Otostop yaparken güvenlik önlemlerini dikkate almak ve kendi sınırlarınızı belirlemek önemlidir.\"\n- \"Otostop yaparken yaş, cinsiyet veya görünüm gibi faktörlere önem vermeden herkesi kendine göre değerlendirmek önemlidir.\""
}