{
    "podcast_details": {
        "podcast_title": "Speaking of Psychology",
        "episode_title": "Encore - Can a pathological liar be cured? with Drew Curtis, PhD, and Christian L. Hart, PhD",
        "episode_image": "https://ssl-static.libsyn.com/p/assets/f/1/d/9/f1d9d46316c74234/SpeakingOfPsychology-Logo.jpg",
        "episode_transcript": " Speaking of psychology is taking a summer break, so we're rerunning one of our favorite episodes from the past. In January, I talked to psychologists Drew Curtis and Christian Hart about pathological liars. What drives them, how you can recognize them, and how you can protect yourself from being duped. We hope you enjoy this episode from the archives. Speaking of psychology, we'll be back with new episodes on August 23rd. Thank you for listening. Almost everyone lies occasionally. Even if you consider yourself scrupulously honest, you've probably told the occasional fib. But for a small percentage of people, lying isn't something that they do every once in a while. It's a way of life. Researchers have found that while most people tell between zero and two lies per day on average, the most prolific liars might tell five, 10, or even 20. In recent weeks, the liar most in the news has been newly elected representative George Santos, whose long list of career embellishments, deceptions, and outright falsehoods came to light only after he won his seat. Santos appears to have made up college degrees, real estate holdings, even Jewish ancestry, among his many other fabrications. So what drives big liars to lie? And are their motivations different from those other people who lie less frequently? Is pathological lying a mental health disorder? How common is it? And are liars more prevalent in some professions like politics or sales, or those unfounded stereotypes? Are there differences in lying between men and women, people of different social backgrounds, or among people who consider themselves religious? And finally, how can you recognize prolific liars in your life and protect yourself from being duped? Welcome to Speaking of Psychology, the flagship podcast of the American Psychological Association that examines the links between psychological science and everyday life. I'm Kim Mills. We have two guests today. The first is Dr. Drew Curtis, an associate professor of psychology and director of the master's and doctoral programs in counseling psychology at Angelo State University in San Angelo, Texas. Dr. Curtis is a licensed clinical psychologist who studies pathological lying and deception, particularly in the context of therapy and within healthcare professions, intimate relationships, and parental relationships. Our second guest is Dr. Christian Hart, a professor of psychology and director of the Psychological Science graduate program at Texas Women's University. He is an experimental psychologist who conducts research primarily on lying and deception. He is also the former president and current executive director of the Southwestern Psychological Association. Doctors Curtis and Hart are the co-authors of the book Pathological Lying, Theory, Research and Practice, which was published in November by APA Books. They are also writing a book for the general public called Big Liars, What Psychological Science Tells Us About Lying and How You Can Avoid Being Duped, which will be published by APA Books later this year. Thank you both for joining me today. It's a great pleasure to be here. Thank you. Thanks for having us. Great. Well, I started the introduction talking about how we all lie sometimes. So what is the difference between someone who just lies occasionally and a pathological liar? Is it just how often they're lying or are the causes and motivations different? Dr. Curtis, you want to take that one? Yeah, absolutely. A lot of our work has really set out to ask that question among people who lie. Is there a clinical population? Is there a group that's different from people who might tell big liars? And essentially we found and put forth theory and research that suggests there is. And so the criteria for pathological lying is people who tell an excessive amount of lies and that impairs their functioning, brings about distress and poses some kind of risk of danger to themselves or others. Dr. Hart, let me ask you, what about the substance of the lies? When we're talking about a pathological liar, does that person tell different lies from just, you know, your average everyday garden variety liar? Well, there's not a lot of research on that topic. What we can gather from reading through the extensive case literature on pathological liars over the past century is that their lives tend to be somewhat varied. We can find some pretty clear cases where they're lying for some sort of financial motivation or financial gain. But one of the patterns that we tend to see perhaps more than you'd see in your typical everyday form of liar is lies that are aimed at bringing attention on oneself. And so that's probably the biggest distinction that we see. Pathological lying is not at the moment considered a mental health diagnosis, but you have both advocated for it to be added to the Diagnostic and Statistical Manual of Mental Disorders. Why is that? Why do you want to see that? Well, I think it's got a robust history in clinical psychiatry and psychology. A lot of our work and research on the literature, the most prominent psychiatrist, the times, you know, late 1800s, early 1900s have well documented the existence of pathological lying. And it's held different names, you know, like Pseudologia Fantastica, mythomania. And so it's been well documented and tucked away by what we would say is the most prolific, prominent researchers and clinicians throughout time. And so it's been recognized by them early on. And then some zeitgeist, essentially, we've lost it throughout time. And so Chris and I have picked back up the gauntlet to look at this phenomena. Our research has corroborated based on that theory that there is a group of people who they're lying impairs their problems and they're looking for some kind of treatment or some kind of help. So we've essentially just been very passionate to look at that. And our research has corroborated that it should be recognized as a diagnostic entity. How optimistic are you that you will succeed in getting the diagnosis included and what's involved in that? There's a lot involved and I guess I'm fairly optimistic. You know, the DSM, the American Psychiatric Association has criteria for what needs to be done when submitting that and there's task force and many intelligent people working hard to recognize these things that It's not maybe what some of the common public thinks is you just create a label to stigmatize people, that it's a pretty lengthy process and you have to show that there's the existence of something that people struggle with. And by providing a label, there's going to do more benefit than cause harm. And so I think not only our work, but work of others before us have demonstrated that there's more people who truly suffer from this and want help. And anecdotally, we've had people reach out to us via email saying, hey, I came across your work and I'm willing to travel across several states for treatment. I need help with this or significant other marriage is about to end and desperately need some help. And can you help me? And it's unfortunate when we don't label it as a diagnostic entity. You know, at this point, we can't say we can formally call it anything and can't treat you accordingly. And so, it would be beneficial then to the person who thinks that they have the disorder, that their insurance, for example, would cover the treatment. That's why we need this, right? That's one of the major reasons. You certainly want some insurance to cover treatment. And then another reason we want to recognize treatment is so researchers can start looking at what are the effective treatments. what are the empirically supported treatments that we can use to help people treat this in the most cost effective and time effective manner. Well, Dr. Hart, let me ask you, how common is pathological lying? Do we know what percentage of the population might qualify as a pathological liar? Yeah, answering that question has been a little problematic. Historically, researchers have looked at it, but they've looked at it within kind of narrow populations, populations that were having, you know, people in juvenile detention facilities and things like that, where obviously you might expect the rates to be considerably higher than the general population. Drew and I conducted a study that we published a few years ago where we tried to look at this and Based on the data we collected, we are showing rates around like 8% to 13%, but a big caveat with that is we are collecting data from people on websites where they might have some particular interest in this and might be more likely to have a problem with lying. So the more recent data that we've collected that we talk about in our book, I think we would put the the rate at somewhere closer to 5%, if not even smaller than that. And one other thing there, without having this as a diagnostic entity labeled, we can't collect some of that data too. So I think it's chicken or egg. Once we recognize pathological lying in the DSM, then as it's getting diagnosed, we can get more accurate data of what its prevalence is. Now your book talks about differences in lying based on gender, social status, and some other demographic characteristics. Could you detail what you and other researchers have found in those areas? Sure, I'll talk a little bit about that. With gender, we don't really see any gender differences in the frequency with which people lie. We do see some differences in the types of things that men and women lie about. For instance, women are more apt to tell lies that are relational in nature, whereas men are more apt to tell more kind of self-serving, selfish lies. I guess it would be the best way to describe them. We see some other traits and characteristics that are associated with more frequent lying. You mentioned religiosity at the beginning of this program. We actually just completed a fairly large study on that topic and didn't find much of a relationship at all between religiosity and lying. Age is probably the biggest factor. If we look at the frequency of lying across the lifespan, lying seems to peak in late adolescence. So it kind of gradually increases throughout childhood, peaks in late adolescence and then slowly declines across adulthood. So age is certainly the factor that we've identified so far that seems to be the strongest predictor of lying. Then we also have personality traits. Your listeners are probably familiar with the dark triad personality traits. You know, these different malevolent personality traits, those tend to be associated with lying. Looking at kind of big five personality traits, we find that people who are low in agreeableness and high in neuroticism are more likely to lie. And then finally, people who have low self-esteem are much more inclined to lie than those who have higher levels of self-esteem. So I think the research shows that lying in people starts around age three, right? That's when children first figure out that they can sort of fib to mom and dad. But at what age does pathological lying start? Do you know? Our work has largely suggested the onset primarily in adolescents, late childhood adolescents. And so one of the studies that Chris and I with Dr. Victoria Tau are currently working on is looking at an adolescent sample to look at some more specific factors of etiology. So looking at executive functioning within that group and looking at the onset. So digging a little deeper into adolescents. There is a stereotype of dishonest politicians with George Santos being a very extreme example right now, although not the only one, or other types of snake oil salesmen. Is there a kernel of truth to that? Are pathological liars more common in some professions than others? We haven't seen any evidence of that. When we look at lying generally, we see that people tend to lie when they have a motivation or an incentive to lie. And those motivations and incentives are more common in some professions than others, certainly. In sales and in politics, it's very difficult to be entirely honest and effectively do one's job. And so taking politics as an example, we can see that people who go into politics don't seem to be any less honest typically than people in the general population. However, what we see is that politicians who lie more are much more likely to be reelected. And so what it suggests is that the people who go into politics are probably no less honest than you and me, but there's something about the profession that pushes them in a direction where they might have to conceal certain truths that might cause them to lose some of their favorability with the public. and might push them to fabricate information and exaggerate and perhaps even conceal the truth and lie. Well, are pathological liars aware that they are lying or do they tend to believe what they're saying and do they really grasp the consequences of their falsehoods? Our research has indicated different research asking about questions of awareness or even some assessment research we've done where we've brought people in conducting psychological evaluations one-on-one. For the definition, let me back up, the definition of lying is an intentional act. So you're intentionally trying to make someone believe something you don't believe to be true. And that definition is important for us because it helps distinguish delusion or aspects of psychopathology of psychosis where someone's delusional, where they're actually intending to lie. And so with that awareness, you know, many pathological liars are aware and they are intentionally lying. Now, sometimes, you know, sometimes they may say it's for an innocuous reason or sometimes they may say, I don't know why I said what I said. Or, you know, someone ask you, what's your favorite cereal? And you say Wheaties, even though it's Cheerios and like, why did you lie about that? That's seemingly innocuous. Why would you do that? They may say something like, I'm not sure why I did. And then it can build up from that, becoming this monstrous lies to cover lies to cover lies. But many of the times that they are aware and in the moment they'll say doing so almost as a compulsion reduces the anxiety and they feel momentarily relief. But then sometime afterwards, maybe hours, maybe the next day or two, that's where the remorse and the guilt comes in where they're thinking, why did I lie about Wheaties? Why didn't I just say, I like Cheerios or why did I lie about my favorite band or song? Why did I do that? And that's where the guilt and remorse will be present. Are pathological liars more likely to be dishonest in other ways? For example, were they more likely to cheat on their taxes or have extramarital affairs? Or is lying its own thing and it's just a separate type of dishonesty? That's another area where there's not much research that's been carried out specific on pathological liars that would allow us to answer that question. However, if we look at lying more broadly, what we have found in our research is that if people tend to tell one type of lie or behave dishonestly in one type of way, they tend to lie and be dishonest in other ways as well. For example, we've measured various categories of lies from benevolent white lies to malicious lies to kind of vindictive lies. What we find is that people who tell a lot of one type of lie tend to tell a lot of the other types of lies as well. There's these strong correlations between the different types of dishonesty. What this suggests to us is that for the most part, if we're categorizing someone as being a prolific liar, they're probably going to be lying across domains. However, we also make a point in our upcoming book that some people are deceptive in specific niche areas, and so we're talking about occupations a little bit ago. So someone might be in a position where they find themselves recurrently lying at the workplace, either to deal with a problematic boss or to sell products to customers or what have you, but then might be fairly honest with their family. And so we can have certainly examples of people who have these niche areas where they're prolific liars and honest in other areas, but by and large, dishonest people tend to be dishonest across the different domains of their lives. There's a documentary that just launched on Netflix about Bernie Madoff, who pulled off the biggest investment Ponzi scheme that we have ever seen, even bigger than the similar scheme we're seeing right now, apparently by cryptocurrency dealer Sam Bankman Fried. Types of frauds where you rob Peter to pay Paul as they say are arguably a form of lying would you view people who perpetrate these types of frauds as pathological liars even though at least in these cases these individuals appear to be honest in other areas of their lives. Yeah, I think if we're going to talk about whether they're pathological liars or not, I'll invite your attention back to the way that we've been characterizing pathological lying in our in our book and the way we characterize it is these are people who prolifically lie, but the lying causes distress and dysfunction in their lives and so forth. And so when we look at people like Bernie Madoff and other scammers and fraudsters, I think it's probably in many cases we're looking at something more along the lines of an antisocial personality disorder rather than what Drew and I would conceptualize as pathological liars. So these are people who are certainly doing a lot of lying, but their lying is very specific with this malicious intent to manipulate and take advantage of others with this callous disregard, lack of remorse and so forth. Does pathological lying tend to be a separate disorder or is it associated with other disorders that have say a more formal recognized diagnosis at this point? Well, that's, you know, that's a great question that many times comes with some clinicians. One of the studies Chris and I did was looking specifically at psychotherapists, looking at licensed psychologists. And, you know, when there is no diagnostic label, what do you do? So we found a number of our research participants who are licensed psychologists indicated they had come across individuals who are pathological liars and they believe them to be pathological liars. And so what they ended up doing was to provide some treatment needed some diagnostic category. Many times they would give a personality disorder diagnosis. And so that happens. And sometimes, you know, there may be rebuttals or arguments against some of the work Chris and I are doing from others saying, well, that pathological lying is just a symptom of something else like a personality disorder. It's a symptom of antisocial personality disorder. Some of the work that we've done in our lab assessing individuals, giving them psychological evaluations, we find that the pathological lying sample They don't fit the diagnostic criteria for antisocial personality disorder. Many of them haven't had any kind of run-ins with the law or any kind of forensic complications. Many times there's lack of, there's no aggression. So aggression is another criteria of antisocial personality disorder. Many times, as I said earlier, they tend to feel remorse. And so that doesn't fit the same picture as antisocial personality disorder or psychopathy. And so separating that is very important for clinicians. It's also good for people to understand who might be suffering from pathological lying where they line up. And then Charles Dekay from Yale suggested pathological lying as well being considered for the DSM as a diagnostic entity and under that specifiers of factitious disorder. And so Chris and I, based on our research, would agree with Charles D. Case suggesting pathological lying being the overarching diagnosis and then subtypes and specifiers like factitious disorder or pseudologia fantastica. Are there effective treatments for pathological lying? Can people get better with therapy if they're motivated to do so? And if so, what types of therapy work? Well, as a clinician, I tend to hold an optimistic view of change for people. And so that's where I land. You know, we run in the same problem with, you know, that's a great question. Can people get better? And so we go back to the same problem when we don't have a formal diagnosis for pathological lying. We don't have research based treatments to see what is most effective and will these things be helpful? So that that poses a problem for us. But In our book, we talk about some research we did with therapists and then our own inferences of treatments, and largely therapists and ourselves, we think that cognitive behavioral therapy would be highly effective to treat and work with people who suffer from pathological lying. And so essentially what you can do is help people become aware of their cognitions. What's the function of their lives? Which situations might they have a higher proclivity to tell lies? And typically that's going to be relationally. So being aware of those situations. And then a lot of behavioral treatments. Some of these we call differential reinforcement of other behavior or habit reversal training. Essentially, the idea is you become aware of your behaviors, become aware of when you lie and and not give that attention, rather reinforce honesty behaviors. And that may mean even when honesty doesn't necessarily lead to a good consequence. You know, if you tell someone that ask you, do you like my new haircut? My son just got a new haircut. And he doesn't like it too well. So if you if you get asked that, you know, you could lie to make someone feel good. Oh, it looks great. Or you could be honest. And, you know, there's some consequences there. But even with pathological lying, we'd have to reinforce telling the truth, even if the consequence may not be the most desirable for the person. But isn't there kind of a catch 22, though, for the therapist, because you're dealing with somebody whose problem is lying. So how do you know that your patient is telling you the truth? Yeah, that's a great question. And that kind of fueled a lot of Chris and I are interested in this early on in our work early on in just deception within therapy. So therapy rests on the assumption of honesty, that all that we do and talk therapy is that we assume our patients are honest. One of the things with pathological lying to understand is even though they tell lies much more frequently than most people, they're not lying all the time about everything. And so even in some of our assessment studies, the question I would ask people at the end is what have you lied to me today about? And many of them would indicate nothing. Why not? You know, why haven't you lied? And many of them would say answers like, well, this is a real struggle from me. I'm hoping to advance science. If you learn from me, you can help out other people. So so they're not lying all the time about everything. And I think that's important to note. The other thing to note there, too, is I think very important for therapists is when someone lies to us, we typically take it personal and get defensive, and that typically isn't productive in therapy. So the way you overcome that is kind of know your stance, become non-defensive. and use that to try to understand with the patient, what's the function of this lie? Are you wanting me to give you praise? Are you wanting me to think of you in a certain light? Are you trying to form a certain impression? Do you not want me to think poorly of you? But if you start asking those questions, I think that that would breed more trust and compassion for the person to lean in and understand them. And that's why Chris and I really wrote the book we wrote was to lean in and understand pathological lying much deeper rather than just turning away and saying these are crazies that we can never understand, but people who are suffering and want help. What about group therapy as a treatment? Doesn't that give you the option, the opportunity for other people to sort of call out liars as opposed to having the therapist have to do that? Yeah, we suggest group therapy and I'm laughing because you're absolutely right. You know, one of the ways that group therapy works is the therapist doesn't have to call out the patient. So the brilliance of any kind of interpersonal work is other members in the group can say, BS, you just lied. That works so well in a group therapy context because it's not about patient-client opposing each other. Rather, it's about other people seeing this thing in you too. Dr. Hart, let me throw this one at you. How can people recognize and protect themselves from pathological liars? Are there telltale signs or particular personality traits of the most hardened pathological liars? I think we know that we're very bad at telling when people are lying to us. And pathological liars, I mean, how do we suss them out as opposed to just an everyday liar? Yeah, it's a perplexing problem, and you're correct. People are really poor lie detectors. If we look at people's ability to detect when people are lying versus being honest in laboratory studies, what we find is that people perform at only slightly above chance levels. That is, they'd be almost as effective just flipping a coin, guessing whether someone's being honest or not. And it really kind of gets back to the fact that we are a cooperative species and so we tend to have what's referred to as a truth default. That is, we just assume people are being honest when they speak and so we tend not to be on guard for deception. So when we look at how people actually detect lying, it's not by seeing that someone's looking askance or they're fidgeting with their hands or shuffling their feet, but rather we detect people are lying by hearing them say things that conflict with factual information we actually know, or we find out they're lying by gathering additional information from third parties, or in some cases people just feel guilty and confess. And so when we look at how could we avoid being duped by pathological liars, My answer would be it's the same way we avoid being duped by everyone else. And primarily what that is, is we are sensitive to signs of trustworthiness. When we meet people, we walk in with usually a fairly trusting attitude, but we only trust people so far. And so for example, if we know that someone has an incentive to lie to us, an incentive to manipulate us, we're going to be more on guard and more apt to detect their dishonesty. Likewise, if we can rely on people's reputations, if I know nothing about your reputation, I'm going to be a little bit more suspicious of things you say than if I know you quite well and know you to have a reputation as being an honest person. But generally, when we've talked to people about pathological liars that they have met or known and how they knew those people were lying, what we find is they say that the people say unbelievable things. That is, they're making claims that just don't seem likely to have actually happened, or they say things that are inconsistent. And so for example, you were mentioning the case of George Santos. I believe he indicated his mother died during the 9-11 attacks and then later claimed that she had died a decade later. And so when we see inconsistency in information, that can be a cue. So really what we're doing is we're looking for coherence, we're looking for proof, and we're looking for the reputational status of a person. All of those together can inform us of who we should be suspicious of and maybe who we can be more trusting of. So how will your upcoming book online differ from the one that we at APA have already published? I found that to be quite accessible. I mean, I don't think you need to be a psychologist to read that, but what's going to be in your new book? Well, thanks for the kind words about the first book. We were hoping to make it accessible, but the difference in the second book is it doesn't focus on pathological liars. We certainly address pathological liars, but we look at people who lie prolifically or tell extremely consequential lies aside from pathological liars. We're probably talking in a lot of cases about people who exhibit signs of psychopathy or antisocial personality disorder or other personality disorders. But really what we're interested in is the people who tell the consequential lies or the extremely frequent lies where they develop a reputation as being a dishonest person. And we're looking at how do they develop into these types of big liars? What are the consequences of their big lying, both on themselves, on the people around them, and on society more broadly? And then we examine ways for cultivating honesty, both in ourselves and the people around us. And we talk to a certain degree about different tactics we can use to avoid being duped. So what are you both working on now? What are the big questions that you're trying to answer at the moment? One of the things I kind of mentioned earlier that Chris and I with Victoria Tower are working on it, digging deeper into the etiology. So onset and cause of pathological lying, the big broad question all psychologists have, nature and nurture, how much of one or the other. And as a clinician, most clinicians want to understand etiology. So we're really digging into those questions that we don't know. about how it develops and how it maintains and then are there certain developmental trajectories that lead to a path of pathological lying compared to normative lying. So that's where we're focusing a little more specifically right now with some of our research. Chris, do you want to add to that? Yeah, we're also doing a little bit of work on the motivators, what drives people to lie, especially what drives people to lie to excess. And so we can see that people don't lie randomly. They don't lie for no reason at all. If we see someone lying, there's some sort of an incentive that's driving them to lie. But we also, most people balance that with some disincentives to lie. So if you are caught lying, it's certainly going to affect you reputationally, which is going to hamper your ability to have the types of social relationships you desire. But then we also each have a moral sense of self that seems to curb most of our bad behavior. So we don't refrain from bad behavior simply because we're worried about getting caught. We refrain from it because We don't want to view ourselves as being awful people. And so trying to understand those complex motivations that are behind people's decisions to lie, especially lie prolifically or remain honest is another area of interest of ours. And then one other thing more recently, Chris has led, is developing an instrument to assess pathological lying more fully, an instrument that researchers and clinicians can use so we can assess pathological lying to answer some of these questions, get a little more accurate prevalence rate, and study these things. Well, I want to thank you both for joining me today. I have found our conversation really interesting and enlightening, and I mean that honestly. We appreciate it. We enjoyed it as well, honestly. Thank you so much for having us. It's been a great pleasure talking with you. You can find a link to pre-order the book Big Liars on APA's website, www.apa.org, and just go there and search for Big Liars. Or if you can't wait, you can order their current book, Pathological Lying, Theory, Research, and Practice, also on the APA website. For previous episodes of Speaking of Psychology, visit us at speakingofpsychology.org, or you can find us on Apple, Stitcher, or wherever you get your podcasts. And if you like what you heard, please leave us a review. If you have comments or ideas for future podcasts, you can email us at speakingofpsychologyatapa.org. Speaking of Psychology is produced by Lee Weinerman. Our sound editor is Chris Kondayan. Thank you for listening. For the American Psychological Association, I'm Kim Mills."
    },
    "podcast_summary": "In a recent podcast episode about pathological lying, psychologists Dr. Drew Curtis and Dr. Christian Hart discussed the causes and motivations behind pathological liars, as well as how to recognize them and protect oneself from being deceived. They explained that pathological liars are individuals who tell an excessive amount of lies, which impairs their functioning and poses risks to themselves and others. While there is no recognized mental health disorder for pathological lying, the psychologists advocate for its inclusion in the Diagnostic and Statistical Manual of Mental Disorders. They also debunked the stereotype that pathological liars are more prevalent in certain professions, such as politics or sales, and discussed the differences in lying based on gender, social status, and other demographic characteristics. The psychologists emphasized the need for effective treatments for pathological lying, such as cognitive-behavioral therapy, and are working on further research to understand the etiology and motivators of pathological lying. They also discussed the importance of trust and reputation in detecting and protecting oneself from pathological liars. Dr. Curtis and Dr. Hart have published a book on pathological lying, and are currently working on another book about big liars and how to avoid being duped.",
    "podcast_guest": {
        "name": "Drew Curtis",
        "job": "associate professor of psychology and director of the master's and doctoral programs in counseling psychology at Angelo State University",
        "summary": "",
        "URL": "https://www.angelo.edu/live/profiles/1356-drew-curtis"
    },
    "podcast_highlights": "- Highlight 1 of the podcast: \"The criteria for pathological lying is people who tell an excessive amount of lies and that impairs their functioning, brings about distress and poses some kind of risk of danger to themselves or others.\"\n- Highlight 2 of the podcast: \"We found that the rate of pathological lying is somewhere closer to 5%, if not even smaller than that.\"\n- Highlight 3 of the podcast: \"People who tell a lot of one type of lie tend to tell a lot of the other types of lies as well.\"\n- Highlight 4 of the podcast: \"Therapists and ourselves, we think that cognitive behavioral therapy would be highly effective to treat and work with people who suffer from pathological lying.\"\n- Highlight 5 of the podcast: \"When we look at how could we avoid being duped by pathological liars, my answer would be it's the same way we avoid being duped by everyone else.\""
}