{
    "podcast_details": {
        "podcast_title": "Speaking of Psychology",
        "episode_title": "Red with anger or feeling blue? The link between color and emotion, with Domicele Jonauskaite, PhD",
        "episode_image": "https://ssl-static.libsyn.com/p/assets/f/1/d/9/f1d9d46316c74234/SpeakingOfPsychology-Logo.jpg",
        "episode_transcript": " Does your anger burn fiery red? When you're sad, do you say that you're feeling blue? Have you ever felt green with envy or purple with rage? English speakers are familiar with these color metaphors, all of which rely on linking color with emotion. But where do those links come from? Are they universal or do different cultures have different color emotion associations? And can colors actually make you feel calm or sad or angry? Will painting the walls of your house blue help you feel calmer at home? Is there a reason that so many hospitals seem to be painted a particular shade of green? And is there any relationship to the notion that green is associated with feeling sick to your stomach? Color psychologists are studying questions like these and others too. For instance, do people's favorite colors tell us anything about their personality? Are their universal favorite colors? Are there gender differences in how people experience or describe color? Why do we associate pink with girls and blue with boys? And more broadly, how does color affect human cognition and emotion? Welcome to Speaking of Psychology, the flagship podcast of the American Psychological Association that examines the links between psychological science and everyday life. I'm Kim Mills. My guest today is Dr. Domitsela Jonaskaite, a senior research fellow at the University of Vienna in Austria. She is an experimental color psychologist who studies the links between color and emotion and cognition across cultures and individuals. She's also interested in the role of color in aesthetics and art. In her work, she aims to use rigorous research to validate or debunk myths in color psychology. She has authored dozens of scientific articles and also writes a blog for the general public called Color Psychology. Dr. Jonah Skaite, thank you for joining me today. Thank you for having me. Are color associations universal? Do people around the world associate the same colors with the same emotion or does it vary by country? and culture. You've done some research in this area. Tell us what you found. So we actually wanted the same thing, other links between colors and emotions, universal. So we started the International Color Emotion Association survey, currently running in 80 countries. And we have it in 46 languages, which sounds like an amazing, amazingly big work to do. And we managed to collect data from over 15,000 participants. And now we kind of have an answer to this question. And the answer is yes, the links between colors and emotions are universal. So wherever you go in the world, you will find that people associate red with anger and love, yellow with joy, black with sadness, and so on. And of course, there are also some more culture-specific associations. For example, we know that red is a color of good luck in China. So on top of these universal associations, they also have some specific associations like associating red with joy and amusement and more positive associations. So kind of our culture is shaping the universally-based color-emotion associations. And is that intrinsic or is it somehow learned? Because many of us are just exposed to these kinds of concepts. Yes, so it's not an easy question to answer because to know that we would have to look at infants and they don't really have the language for colors and the language for emotions. So what we see in infant studies is that there is an immediate reaction to color red. So color red attracts attention and infants look at it longer and we can assume that they prefer this color. But does it mean that they associate with emotions? We don't know. And when we go to older participants, we start seeing that these associations are emerging as children are growing up. And the older children get, the more the more diverse associations get, which is kind of showing that they are learning it over time by being in society. And in fact, here fits in the research I'm currently conducting on blind participants, that even if people who have never seen color in their lives, so they are blind from birth, they can still associate colors with emotions in a very similar way. So again, we're talking about this universality, and we are talking about the idea that color-emotion associations are learned. I mentioned in the introduction some color phrases like feeling blue when you're sad or being green with envy. Do you have any favorite color metaphors from other languages or cultures that maybe would surprise English speakers? Well, first of all, I wanted to comment on this feeling blue because this is the metaphor that only exists in English. So when we go to other languages, we don't find it. And we find that people think blue is a very positive color associated with calmness, contentment, relaxation, and even English speakers. In addition to associating blue with sadness, they are associating it with positive emotions. Now, talking about color metaphors in other languages, as we know, metaphors are notoriously difficult to translate. But maybe I can mention one from my native language, Lithuanian, where we are talking about the degrees of anger through different colors. So, if you are a little bit angry, you are white. And then you get more angry than you are red. I think that's like the standard anger. And then you get furious, you get black. And if you are extremely, extremely furious, then you are purple. So, languages can also code not only the emotions with colors, but also the intensity of emotion with colors. Can colors make us feel emotions? Like, I'm wondering if you're in a red room, Are you more likely to become angry or feel amorous or do you feel calmer if you're looking at blue or green in a landscape? This is a very good question. I've been working on the links between colors and emotions for 10 years. And every time we are researching them, we are just associating the color with the word of emotion. So this kind of research doesn't mean that colors make you feel anything. To answer this question, we have to put people in spaces that are colored through, let's say, VR or light or paint. And then we need to measure their felt emotions. So, there are very few controlled studies in this domain and the ones that are there, they are showing very contradictory results. So, in fact, it seems that colors are not affecting our emotions that much, especially they're not affecting them so specifically that if you are in a red room, you would feel anger. Yes, maybe you feel a little bit more excited. That's one of the findings that we have. Red increases arousal, but somewhat. But the effects of colors on emotions are not so specific. So when we talk about all these links like yellow and joy or envy and green, we are really in the domain of our minds. We're not really in the domain of felt emotions. And now let's take a moment for some messages from our sponsors. Science says our ability to learn new languages peaks when we're children. But since we can't go back to being six years old, here's the next best thing. Babble. Because with Babble, you can start speaking a new language in just three weeks. Why Babble? Because Babble is designed by real people for real conversations. All of Babbel's tips and tools for learning a new language are approachable, accessible, rooted in real-life situations, and delivered with conversation-based teaching. And Babbel's advanced speech recognition is like having your own personal language coach to help improve your pronunciation to get you prepped and confident for real-world conversations. Babbel is not just a game to occupy your time and make you feel like you're learning a language, and it's not overly academic and rigid. It's not always easy, but it is simple. And if you want a live classroom experience from the comfort of your home, Babbel Live is for you. Babbel Live classes are available seven days a week at all times of the day and taught by certified teachers so you can learn on your schedule. Here's a special limited-time deal for Speaking of Psychology listeners to get you started right now. Get 55% off your Babbel subscription, but only for our listeners at babbel.com slash apa. Get 55% off at babbel.com slash apa. That's spelled B-A-B-B-E-L dot com slash apa. Rules and restrictions may apply. So in prepping for this, I ran into some stories about the idea of drunk tank pink, and I'm hoping that you have encountered that in your work as well. This came from some research years ago that led to some prisons painting cells a particular shade of pink, thinking that it was going to calm down the inmates, but then later they discovered this was flawed. Can you talk about that research and what's wrong with it? You're talking about the Baker-Miller thing. The original studies were conducted in the 70s and they showed that prisoners supposedly got calmer when they were in the pink space. But in fact, they didn't really run the studies the way we are running studies nowadays. In other words, the prisoners spent one year in the white cells and then the second year in the pink cells. So obviously when you spend longer in the cells, you are less aggressive. And in 2015, Gensho and colleagues re-ran the study in using modern methods in psychological science and they found absolutely no difference between the white and the pink rooms for prisoners' aggressiveness. So we can say that no, Baker-Miller pink is not reducing aggressiveness in prisoners. And yet today, one in five prisons in Europe have at least one pink prison cell. So what does it mean? We are implementing the findings that we are not sure about much faster than the science can run behind. And therefore, it's so important to run systematic studies and really understand the phenomenon before we are bringing them into our consumers and policymakers. So speaking of controversial studies, you've done some work in the area of chromotherapy, which purports to show that certain colors might have healing properties. Is there any scientific evidence to support that notion? A short answer is no, not yet. So I will tell you quickly about the study we conducted. Basically what we did in the study is we saw participants, half of the participants saw colors and the other half of participants saw a white sheet of paper. And we measured their stress and anxiety before and after the intervention. There were also other aspects like music and guided breathing in this intervention. And we found that their stress, anxiety were reduced after the intervention than before the intervention. So it speaks as if the intervention worked. The problem was that this reduction was exactly the same for the group which looked at colors and for the group that looked at the white sheet of paper. So, it means that it's not really due to colour, but probably other aspects. I mean, we know that mindfulness works, meditation works, so we just prove kind of the same thing. But when it comes to colour, no, we cannot say that in this study, at least, colour therapy worked. There are very few studies conducted in the area. And lastly, when we talked with participants after the experiment and we asked how they felt, Some of the participants who were in the white condition, they said, oh, I wish I could have seen colors, it would have made my experience different. And those who were in the color condition said, oh, you know, I closed my eyes and I was just listening to the music and breathing. Also, people do what they do and there is no biological mechanism. We're not talking about light here, we're really talking about a sheet of paper with color, how colors could change physiologically our bodies. For now, there is not much evidence, but maybe in the future. You just mentioned light and I wanted to ask now, light is generally white in the sense that it contains the full spectrum of colors and there's evidence that exposure to light can have an impact on our mental health. Is that related in any way to exposure to color? Yes and no. So you are talking now about daylight, and daylight contains kind of all the wavelengths together. Of course, we also have colored light. When we think about lasers, we can have any color we want. And what research shows, and it's quite strong, that exposure to intense light can improve mood, even treat seasonal affective disorders, so depression, seasonal depression. And that also goes to exposure to specific frequencies of light in the so-called in the blue range. So we could say that exposure to blue light is exciting, but that doesn't mean that exposure to a blue color is exciting. These are completely different things. We're talking at very high intensities of light. which we can only achieve with a light source. And when an object, when we see a color, we usually see it reflected from an object, maybe a wall or a piece of clothing, and you can never reflect light at the same intensity as the light source is producing. So often when, actually this feeds back to our discussion about color therapy, often when there are claims made about color therapy, they talk about the light, but in fact they work with colors. And these two aspects shouldn't be confused. And now here's a message from our sponsor. Are your subscriptions draining your bank account? Did you know that the average person has around 12 paid subscriptions and might not even remember signing up for half of those? And most people think they're spending around $80 a month on these subscriptions when in reality the number is closer to $200. When you're signed up for so many things like streaming services you use to watch one show or free trials for delivery you don't use, it's easy to lose track of what you're paying for. And if this sounds like you, you need Rocket Money. It's an app that tracks all of your expenses so you know exactly where your money is going. Rocket Money is a personal finance app that finds and cancels your unwanted subscriptions, monitors your spending, and helps you lower your bills all in one place. With Rocket Money, you can easily cancel these subscriptions you don't want with just the press of a button. No more long hold times or annoying emails with customer service. Rocket Money does that for you. Rocket Money can even negotiate to lower your bills by up to 20%. All you have to do is take a picture of your bill and Rocket Money takes care of the rest. So stop wasting money on things you don't use. Cancel your unwanted subscriptions and manage your money the easy way by going to RocketMoney.com slash APA. That's RocketMoney.com slash APA. RocketMoney.com slash APA. Let's talk for a minute about color blindness, which is fairly common, especially among men. About 8% of men have some type of color blindness. Do people who are colorblind make the same connections between color and emotion as everybody else? Yes, so I also conducted research on colorblindness, and in our studies we found that these men who have color vision deficiency, they did associate colors and emotions in the same way, which is very striking because they obviously do not see colors in the same way as non-colorblind participants. So, what we think is happening is that they can name colors very well. Color blindness doesn't mean that you don't see colors at all. Here we're talking about the red-green dichromacy. It doesn't mean that they cannot see colors at all. They only see a reduced spectrum, but through learning, through Growing up in a society where we have colored pencils and colored t-shirts, they get trained how to name even very similar shades of color. They know that this shade of green is red and that shade of green is green. So when you confront them with a color, they can name it at 95% accuracy and then they produce emotional associations which are similar to non-colorblind men. So this kind of finding really speaks towards the idea that color-emotion associations are very conceptual. They really function at the level of our mind and not, they don't have much to do with the actual perception of the color, at least nowadays. Perhaps at the beginning, you know, when they were formed, the perception mattered more, but nowadays it's really about just linking the two. Actually, we have some studies when we give participants a color word and they have to produce the first thing that comes to their mind. And when you give the word red, very often you get back anger. So that's it. The link is direct. Whereas with yellow, we get sometimes joy, but we also get sunshine, sunlight, or with blue we get words like sky and ocean. So here we have some objects that have probably emotional connotations. If we think sunshine, you know, if we live in the rainy countries, then probably be Being in a yellow sunshine makes us feel happy, so it makes sense that yellow is associated with joy. But with red, of course, there is association with blood. But a link between red and anger is so immediate, it's so well established. And if there is one association that you can almost always find, it will be red and anger. Have you looked at all into the Stroop phenomenon? Yeah, maybe you have a sign or a t-shirt that says, it says red, but the color is green. It says yellow, but it's actually orange. And people's brains are not fully connecting because they don't know exactly what it is that they're perceiving. Have you looked into that at all and what's going on in the brain when you take a strip test? Yes, so the Stroop effect is very interesting. Usually there is a color word, let's say red, and it's written in a different ink, let's say blue. And what people find easier is read the color words. They can ignore the color of the ink and they can just read yellow, red, green, blah, blah, blah. But what they find more difficult is to name the ink of the color because we are so trained in reading things that there is an interference between the reading and the naming of the thing we are seeing. How this links with emotions, I don't know. We've never used this test in our studies. But my prediction would be that when we ask them to link the words, probably they would have no problem associating them with emotions. But when we ask them to link the colors of the ink, there will be this interference effect. But again, I don't know if we haven't run the study. Let's talk for a minute about favorite colors. There are a lot of quizzes that you can take online that would have us believe that people's favorite color can tell us something about a person's personality. Is there any research that backs that up? Again, this is a very uncharted territory. When we started researching color preferences, favorite colors, we were stunned. Because over and over again, wherever you look, we find that blue is the color that everyone likes. Or in other words, at least it's the color that no one hates. And this finding, you know, has been reported a hundred years ago and every study nowadays is still, no matter where in the world you are, blue is the favorite color. On the other hand, colors like yellow and pink are really disliked. Now, what does it tell about our personality? we wondered the same. And we went online and we looked at different statements that are made. For example, it said that if you like red, you are an extrovert, and if you like blue, you are a calm person. And it already made me think that, okay, they are talking about the same kind of associations that we just talked about before, like blue and calmness, but now they are being translated into the personality domain. And it's never really, yeah, they're interested in the personality domain. So we set ourselves to test this. We extracted the most frequent predictions and we collected data from 400 participants. They said their favorite color. They also told, they also completed the personality questionnaire and we tried to correlate the two. To cut a long story short, we didn't find any links between one's favorite color and one's personality, suggesting that it doesn't really matter what you like. At the same time, you find that 50% of people are choosing blue anyway. So there is not so much variability in the favorite colors. Another thing that we find is that these predictions, let's say about red and extraversion, they also apply to other colors. If you like orange, you're extroverted. If you like yellow, you're extroverted. If you like pink, you're extroverted and so on and so forth. So how can these associations be specific anyway? So from the scientific point of view, in fact, all of these claims do not make much sense. In contrast, what makes more sense is the colors that we choose to wear to signal certain things to people. A study conducted by my colleague Chris in Rochester Institute of Technology showed that if you are looking at someone wearing red, you think they are more extroverted. So it doesn't matter whether they are actually more extroverted or not, but the choice of color is signaling certain properties and they have meaning in our society. Are there gender differences in the way that people experience color? I'm asking because there's a stereotype that women notice and name multitudes of subtle shades. They'll talk about lilac and lavender and periwinkle, while men will just say purple or blue. Is there any science that backs that up, or is that just a stereotype that's based on gender expectations? Indeed, this is a very, I know exactly which meme you are talking about. And what I can say is that there is a high variability in the number of color terms people know. So some know only 11 basic terms and others maybe know 100, especially when we go to specialists who have to use colors in their everyday life. There is a very high variability, but there is no difference between men and women. Some men can know a lot of colors and other women can know a few colors, a few color terms. How did we end up associating pink with girls and blue with boys? Where did that meme come from? Yes, this is actually not a very old association. This is about 100 years ago in the 1920s. It just popped up that suddenly society started coding, gender coding the kids before they were wearing white. And there is this idea that there was a reversal in the association, that in the past boys were associated with pink and girls with blue. So this is actually not so true. Perhaps people didn't really care so much about coding their infants with this color. And I cannot tell you where this association came from, but I can tell you that it's very prevalent. And nowadays, not only in the Western societies, but also in other places wherever you go, you find this kind of gender coding. And this is also reflected in color preferences. Very small girls at the age of two, when their gender identity starts forming, they start liking pink and boys start liking blue. And very interestingly, over the years, already at the age of five, boys completely avoid pink. So it's really about the pink, it's not about the blue. I just told you that blue is one of the favorite colors of everyone. So it's really about the pink that boys are avoiding pink and girls like both blue and pink. And with time this kind of gets established also in our language. We recently did a study on Wikipedia articles where we looked at word embeddings and we found that really the word pink occurs so much more often with feminine words than any other color term. Whereas neither blue nor red nor any other color term was not specifically associated with masculinity. So you need these two colors together to know which one is for boys and which one is for girls. That raises the question of whether colors go in and out of style. You could look at a house and pinpoint the decade that it was decorated just from the color scheme. Are these just random fads or can you learn something from colors that are popular at a particular time? I guess this is a question for an interior or exterior designer. Because I've been talking about this universal association between colors and emotions, universally found color preferences, and I don't think that they change that much over time. It's really more the availability and Every generation wants to differentiate themselves from a previous generation and color is one of the ways of doing it. And we see colors coming back over and over again. If you think about this pink in early 2000, it was really the fuchsia, the very bright pink that was popular. And recently, it was a very soft shade of pink, baby pink. And then, yes, there is another term for This very, very soft pink that was popular now with the Barbie movie, perhaps another shade of pink will come up. So we're kind of circling, we take the same hue. So here we're talking about what people normally refer to color, but there are also other dimensions that are important, namely lightness and saturation. Hues can be dark or light, they can be very bright, very saturated, or they can be very grayish and dull. And this is what designers can do. They can take these dimensions and they can play with them and they can give you an impression that you're seeing new colors from time to time, when in fact they're just manipulating a few dimensions. And I know you've done work regarding color in art, and I'm wondering what have you found regarding the presence of color in art? What is the meaning? How do artists choose color? Why do they choose what they choose? Yes, so this is another line of research that I am currently pursuing. And unfortunately, I don't have the data yet. But what I know from others research is that, for example, if you ask people to produce artworks and you ask them to draw anything, but that would represent a specific emotion, let's say anger or disgust, Non-artist participants are using much more common color-emotion associations, whereas artists are using much more uncommon colors. So really, artists' minds have many more diverse associations and they might combine colors in a very unusual way to perhaps evoke a certain feeling in the viewers or to use kind of non-traditional colors. So it is very tricky to research color use in art because you don't know if they're using the color as the society would think or if they're using on purpose the opposite color but they still know about the existing associations. But yes, this is an ongoing research and I hope that in the future I will have more answers. What are the big questions that you still want to answer and what are you working on right now? So currently, as I told you, I'm working on the research studies with blind people and I really want to understand to what extent the psychological meaning of color, the link with emotions, the preferences are determined by our society and to what extent we need to see colors in order to have any of these associations. And I think this preliminary data that I have on a blind people is really exciting because it shows that color is very, very important to them. For example, they say that when they get dressed, they think that they want to choose colors that are matching. They don't want to appear. as a clown, as one of the participants said. So it's really much more high effort task than it is for a sighted person. They have all different ways of matching their colors. And then they know that certain colors symbolize certain things. They say, I like blue, so I want to wear blue and I have to find this blue for myself. So really this research for the blind people is opening a new avenue into the world of language and into the world of our culture. So to wrap up, let me ask you one unscientific question, which is what's your favorite color and why? So actually, my favorite color is red, not blue. And I don't have a reason. I think that's how it is with color preferences. Often people just like colors or dislike them. And that's how it is. Yeah. Well, I want to thank you for joining me today, Dr. Jona Schaita. It's been really interesting. Thank you for having me. It's been a pleasure. You can find previous episodes of Speaking of Psychology on our website at www.speakingofpsychology.org or on Apple, Spotify, YouTube, or wherever you get your podcasts. And if you like what you've heard, please leave us a review. If you have comments or ideas for future podcasts, you can email us at speakingofpsychologyatapa.org. Speaking of Psychology is produced by Lee Weinerman. Our sound editor is Chris Condayan. Thank you for listening. The American Psychological Association. I'm Kim Mills."
    },
    "podcast_summary": "In a recent podcast, Dr. Domitsela Jonaskaite, a senior research fellow at the University of Vienna, discussed the links between color and emotion. She conducted a survey in 80 countries and found that the associations between colors and emotions are universal. For example, red is associated with anger and love, yellow with joy, and black with sadness across cultures. However, there are also culture-specific associations, such as red being associated with good luck in China. It was also found that color preferences, such as blue being a favorite color for many people, are not indicative of personality traits. Dr. Jonaskaite also discussed the",
    "podcast_guest": {
        "name": "Dr. Domitsela Jonaskaite",
        "job": "senior research fellow",
        "wiki_title": "",
        "wiki_summary": "",
        "wiki_url": "",
        "wiki_img": "",
        "google_URL": "https://www.researchgate.net/profile/Domicele-Jonauskaite"
    },
    "podcast_highlights": "- The links between colors and emotions are universal\n- Color-emotion associations are learned over time \n- Feeling blue is a metaphor only in English \n- Exposure to colors does not necessarily make us feel specific emotions \n- Favorite colors do not indicate personality traits"
}