{
    "podcast_details": {
        "podcast_title": "Technology Untangled",
        "episode_title": "Keeping the lights on part 1: How do we make more energy?",
        "episode_image": "https://images.transistor.fm/file/transistor/images/show/10913/full_1689007393-artwork.jpg",
        "episode_transcript": " With regard to fusion, there are a number of theoretical and basically scientific challenges, but also engineering challenges. The scientific challenges are around, can I actually exert such tremendous force on, in this case, deuterium and tritium atoms to force them to fuse together? And if they fuse, they release a tremendous amount of energy. And so that's the physics or the science challenge. How can I actually compress and force this fusing or fusion, as we call it? And then the engineering challenge is how do I harness that energy in a safe, secure way and put it on the grid? When the topic of future energy sources and meeting future energy demands arise, one tech seems to always be in the conversation. Nuclear fusion. In fact, we've covered it on this podcast before. It's a technology which is slowly starting to look feasible as access to more powerful compute lets us peer deep into the core of the universe. And indeed, recent advancements in containing and streaming the power generated by forcing atoms together have made headlines promising clean energy sources at some point in the future. The thing is, that's not too useful to us here today because we are using a lot of energy and our appetite is only growing. So what's needed are solutions right now or in the very near future. Solutions driven by proven technology which we know works. So that's what we're going to be looking at in this episode. How to get more energy using the tech we've got. And that includes taking some hard looks at technologies and resources which often get derided. You're listening to Technology Untangled, a show which looks at the rapid evolution of technology and unravels the way it's changing our world. We're your hosts, Aubrey Lovell and Michael Burt. Right now, we need a lot more energy. In 2023, on average, we use 60 kilowatt hours of electrical energy each, per day. That's enough to boil approximately 600 liters of water, or about 160 gallons. Which is a lot, especially when you consider that several billion of us are using a lot less than that. Demand is growing, too, by 3 to 5 percent globally every year. The IT industry is a major contributor to this, using around 6% of the world's electricity. In the next episode, we'll be looking at how to reduce the amount of energy we use. But with the best will in the world, even if we slash our use, we still need more energy right now. So what can we do? How can we generate enough electricity and energy to satisfy our needs? Equally important, how can we make our energy generation as environmentally friendly as possible, or at least minimize our footprint? Nuclear fusion seems like a great choice long term. The act of slamming atoms together to release huge amounts of energy, well it's the way our sun works, and it seems pretty effective. The problem is, we've been saying that for years, decades even, with every new step we take in fusion energy, it's just a few years away, but it never seems to quite arrive. The most recent announcement really did seem to be a game changer though. In December 2022, scientists at the Lawrence Livermore National Laboratory announced that they had achieved something quite remarkable. For the first time, they managed to get more energy out of fusing two atoms together than it took to run the process, an event known as ignition. It sparked, excuse the pun, huge excitement in the media. But this was just a proof of concept. Actual fusion is still a long way off. Doug Cothe is a computational scientist at the Oak Ridge National Laboratory in the U.S. He's an expert in fusion and is going to be helping expand our understanding of the technology even further using the Frontier Exascale supercomputer at Oak Ridge. We've got an episode on exascale computing coming up, but while he's excited about the future, he's also a realist. As an old fusion-eer, my dissertation PhD research at Purdue was in fusion. In fact, my work was on a form of fusion known as inertial confinement fusion, the topic of the recent breakthrough that Lawrence Livermore National Lab announced. And so being able to simulate this complex phenomena gives one a tremendous advantage where you're able to essentially have a digital twin is a term that's often used. I would also say somewhat of a virtual time machine. Or one could ask, what if scenarios on, what if I did this or did that with regard to the design of the fusion reactor? If I have high-confidence simulations, I can answer a whole lot of questions. Frankly, there were times early in my career when I thought we would never see it. It's just so challenging and so difficult. The joke has always been it's 20 or 30 years away. And of course, I'm kind of saying that again, but I really think that we really are close. I think what's important about sort of here and now in fusion is there's excitement. There are a lot of startup companies that are going after it. We may very well see an operating fusion reactor, you know, in the next decade or so. But if fusion is still science fiction, what can we do in the interim? Surely what's needed is a massive investment in renewables to create clean, limitless energy. Well, it's a nice dream, but maybe it's not quite that simple. I did some reading around this and unfortunately, while sources suggest that 85% of wind turbine components can be recycled, there's a growing problem with the lightweight composite blades being dumped in landfill when they are done with because they can't be reused or recycled. Likewise, currently only 10% of solar panels get recycled in the US. Those numbers can surely be improved on, right? Yeah, absolutely, if there's an appetite for it. But right now, maybe they aren't quite as green as we'd like to think. That said, turbine blades and solar panels both have lifespans in the range of 20 to 25 years. So they aren't exactly a disposable product, and we definitely shouldn't be avoiding them or discounting them as solutions. Especially because, frankly, the world needs more energy. not just wind and solar, although they are growing at an exponential rate. It needs more of, well, everything. In 2022, the world set records for its coal and oil use, as well as for wind and solar. In fact, even, get this, hay was up year on year. So, if we're going to find new greener sources of energy, we're going to need to look pretty hard. Well, Michael, it's funny you mentioned hay because it could be part of the answer. Biomass, farm waste included, really is a huge provider of energy. And in the UK alone, burning biomass supplies 40% of renewable energy generation and 5% of total US production. And much of the world, that's a lot higher. And that's just the official numbers. The number of people on the planet still getting energy for light and cooking from burning wood and plant matter is somewhere between two and three billion. And there lies a potential opportunity to use technology to do things better. But surely, burning waste isn't all that green. Well, it turns out there's more to it than that. I'm Patricia Thornley, I'm Director of the Energy and Bioproducts Research Institute that's based at Aston University, right in the centre of Birmingham in the UK, but I also lead the UK's national programme in bioenergy and that's called the Supergen Bioenergy Hub. So EBRI does research into all sorts of energy technologies, but we have particular expertise on converting biomass and waste into heat, power and other chemicals and fuels. That can be done in a way that is not intermittent. Biomass is storable. We produce intermediates with these liquids and gases that can be stored and used on demand. It's incredibly flexible. It can produce electricity, it can produce heat, transport fuels, materials. Bioenergy is the only renewable that can deliver net negative because it is extracting CO2 from the atmosphere and producing energy at the same time. There is no other energy source that does that. You can use a process called gasification and we've got lots of facilities on that in Ebrie. You split them into two, you take the hydrogen that you want as your fuel and then you have the carbon left and that means that you can do something with the carbon. You can either sink it onto the ground and then you get negative emissions or you can use it to produce something useful like sustainable chemicals or materials. So I think that there's a lot of promise along the negative side of things. And we just need to be confident on the sustainability framework, put that to bed, you know, get some really robust science in there. And we are working really, really hard on that. So bioenergy, sustainable bioenergy without relying on imports could produce 45% of the UK's energy demand. That's huge. When we calculated that 45% figure, we were only looking at material within the UK. And most of it is coming from wastes. It's coming from waste material that is part of the municipal waste stream, but also there's quite a lot of agricultural waste and residue. So I'm talking about things like we've got three straw burning plants still in the UK. But we can do more than just get electricity from those. We have other ways that we can deal with it. But you know, you find that most other countries in the world have more land per unit population than the UK does. And therefore, most countries are actually higher than that in terms of what they could provide. Some of them are able to provide, you know, close to 100%. So let's take another look at bioenergy. Biomass really couldn't be further from fusion power. It's the oldest and most basic form of energy generation that we've got. But it needs a serious update. After all, burning wood or straw isn't exactly environmentally friendly or good for us. Even if it is a readily available source of energy. And that creates an issue because most of the world's biomass use is not in industrial plants. It's in individual homes. That's not just environmentally damaging. It's created a health catastrophe. Estimates from the World Health Organisation suggest that 3 million people a year die from long-term health conditions due to burning fuels such as wood, hay and dung indoors. So whatever happens, it needs to be on a grand scale in large power plants where people aren't just breathing in the particulates. The really big issue here is that most of the biomass use in the world today is not modern bioenergy. It is traditional use across Africa and other countries like that where you have biomass used in an incredibly inefficient way for cooking. This is something that just frankly needs to be addressed. It's shocking how many people in the world today still don't have access to clean energy. We need to stem that really unsustainable use of biomass. You know, people going and collecting firewood and burning it at two or three percent efficiency when it could be done at ninety percent. So we need to sort that out. I was involved a few years ago in a project funded by the UK's Department for International Development where we looked at a whole host of countries across sub-Saharan Africa and what they were currently doing and what they could do and we concluded that there's potential for many of them to meet a huge proportion and in some cases all of their energy demand by switching from what is currently unsustainable fuel wood use and bringing that into a more sustainable forum. So instead of going and burning wood directly, you would, let's say, take some of that material, anaerobically digest it or gasify it and turn it into a gas, which then gets used for cooking. If you were to do that, you would have to do it in a dispersed way in, you know, sort of local rural centers because that's where the resource arises and as soon as you start making it travel and collate it, you add complication and cost. So you'd have to do that remotely and rurally. And, you know, frankly, these countries at the moment don't have the electrical infrastructure. to support centralization. So I think that we need to recognize the vast majority of global energy demand isn't what it looks like in European and American context today. It's dispersed, it's rural, and it's for a very different need. That is going to surge in the coming decades. You know, the population growth that's projected in sub-Saharan Africa is huge. The growth in cities across the world is huge, but that means the growth in people and people need fed, so the agri production will increase as well. So I think the areas we really need to focus on are that agricultural and rural production in all sorts of low and middle income countries. And that is the key to actually sorting climate change for the coming decades. But there's another forgotten potential source of untapped power that we haven't discussed yet. And for huge parts of the world, it could be a lifeline. The waves. Over 150 countries in the world have a coastline of some kind or another. But while offshore wind is an increasingly popular choice in developed nations, it comes with its own challenges. It's expensive to install and maintain, and has ecological impacts on local marine life. They also have some survivability issues when it comes to storms, which mean they aren't suitable for large parts of the world. But wave power generators? That's novel. My name's Jonathan Fieve, I'm the CEO of Carnegie Clean Energy. We're a wave energy developer, so we develop technology to convert ocean waves into electricity. Our core product is our CETO wave energy technology, so C-E-T-O, it's actually a Greek sea goddess that has been named after and that core technology converts ocean waves into electricity. You know, like a boat moves around on the waves or a ship moves around on ocean waves, we have a large buoy that moves around on ocean waves, so it's one of the key features of our technology that differentiates it from most of the other technologies is that it is a fully submerged technology so you can't easily see it from the shore and this buoy moves around with forces from each wave and as it moves we convert that motion and that force into electricity through the use of what we call the rotary power takeoff which is essentially a belt wrapping on a drum and that drum connected to a generator so it's connected directly to the seabed as the buoy would go up for instance the belt would pull the drum and rotate the drum rotate the generator and generate that electricity. At the moment, our nominal size is about a megawatt capacity. So, you know, that's a pretty significant generator in its own right. And there's a few markets that wave energy and our technology addresses, the remote island or remote community market, because currently they burn diesel for all their power needs. You know, often these are islands out in the middle of the ocean, also very exposed to the downside of climate change. Now that's a really interesting concept, but wind and waves can be a very extreme environment, right? Getting around that probably means either building much sturdier equipment, which I guess is probably expensive, or replacing your equipment more often, which is also expensive. Yeah, that's normally the case. But Carnegie's CETO technology is different. It doesn't passively collect electricity. It hunts it out and seeks out safety using a combination of clever design and AI. We have three power takeoff systems. In a way, the power takeoffs are like a winch. Each one of them independently connects to the seabed. And our control system, using AI or other techniques, can change the tension in the line very dynamically and we can instruct them to pull or not pull. We can instruct it to pull it down deep if we need to avoid some extreme waves and that's what gives our CETO technology the edge. And the reason why we're so involved, I guess, in supercomputing is because the simulations to understand how CETO behaves in the ocean is to use what they call computational fluid dynamics, which is kind of if you chop the ocean up into really tiny blocks and you sort of allow them all to impose forces on our structure in the water. But to chop up the ocean into little blocks and understand how they all interact with each other has a huge computational load. So hence the reason we're using supercomputers and I guess we ask the question of HPE, well, look, this is where we're at. This is what we're currently doing. But we can see this opportunity for HPE's AI capacity and computational understanding to come together with our wave energy understanding and do something that's never been done. develop AI and deploy it in wave energy in a physical way. In our case, reinforcement learning was the weapon of choice. Whilst fluid dynamic simulations are, I'm sure, great, and I say that as someone who wouldn't really know where to start with them, there really is no accounting for real-world practice. Now the CETO technology is already being tested in wave tanks before being given a true sea trial, possibly as soon as the next year or two. So how do you teach an AI to make itself more efficient and protect itself in a real world environment? Well, I wanted to find out from the team at HPE who made it happen. I am Maria Ridrujo, AI solution architect in the global data analytics and AI practice from HPE services organization. Since last year, I am also the technical lead for our new global center of excellence for AI and data in Madrid. Yeah, Cristian Temporale. I am in the same team as Maria, where I work as AI and data architect, and I am based in Milan, Italy. So reinforcement learning is one of the three main types of machine learning, along with supervised and unsupervised learning. This applied in situations where an autonomous agent, think of a robot, takes actions to achieve a goal while interacting in a physical environment. Each action depends on the current status of the system based on observation of the environment and changes the next status. It is called reinforcement learning because, against the result of a given action, The agent is given a reward that will reinforce or not that behavior. A correct behavior will be rewarded with a high reward. An incorrect behavior will be punished with a low reward or a penalty. So during the training, the agent learns by trial and error based on the rewards received. The agent improves itself by rewards that are proportional to the amount of power generated. So in the end, we maximize the amount of energy converted into electricity. So initially, the system was tested in a fully simulated software environment, so all synthetic data and synthetic output. And with these tests, the reinforcement learning model showed an efficiency increase of 20% over the classical controllers. And then last month Carnegie completed the tank testing campaign for Europe Wave Phase 2 at the Cantabria Coastal and Ocean Basin in Spain. So this is an amazing facility that hosts a multi-directional wave generator and advanced instrumentation. And here they used a scaled down model of the CITO device. And the interesting part of all this process is that the more the model is scaled down, the more challenging it is to control it. Because the time scale is also reduced, the model behavior is more reactive, corrective actions must be taken very quickly, and latency problems are amplified. So in terms of system control and software in general, we are very positive. And the tests were also very promising. For example, in some sections of the RAMs, the moving average power was up 40% over traditional controllers. Things actually can only improve at a larger scale. So amazing. I guess the question is, does the addition of AI make the technology more viable? Here's Jonathan. I would like to think it's not the difference between it being viable or not viable. It certainly means that in markets where the power price is lower, wave energy can be more competitive. it can break into newer markets and have much broader market addressability with the likes of AI. The other thing that AI can do, I mean, I spoke about rewarding it for the electricity production, but that's kind of only the beginning. I mean, ultimately what you want is you want the lowest delivered cost of electricity which is not necessarily producing electricity at peak all the time, it's also avoiding damage from extreme waves and avoiding fatigue damage as well from just cyclic forces. We have actually started to introduce some, I guess, behavioural rewards to ensure it operates safely and they're really showing us that RL can do so much more. It can learn how to do exactly what you want, which is ultimately lowest cost of electricity delivered. So reinforcement learning and AI isn't necessarily the difference between a product working or not, but it can aid large leaps forward in efficiency and lowering costs. And that's huge, because for all of our guests today, costs and accessibility are a big challenge. Here's Patricia. One of the challenges that bioenergy has particularly, as opposed to, let's compare with wind. Wind has lots of big industrial players. The companies who build these turbines are large names, they're big multinationals. When I look at bio, I actually see a landscape that's dominated by SMEs. We've got to start with land. So you've got landowners, you've got farmers, you've got a whole different set of people there whom you need to get on board. You've then got the people who are building clever conversion technologies, and often those ideas are coming from wacky corners. In Supergen, for example, up in the University of Manchester, they're doing work on photocatalysis. So that's literally shining light on material in order to produce electricity directly. That's really hard to do, you know, from a scientific perspective. But the companies who are going to pick that up are going to be quite small. You know, you can't exactly see the likes of BP and Shell going in gung-ho with that. So I think that we've got a lot of small companies doing great things and it's about supporting them in a way that they can scale up. So I think yeah, the SME landscape is a big barrier. It's an opportunity if we deal with this the right way. So I think I would say that, you know, at the moment we've got a biomass strategy under review in the UK. What I want from that is two things. I want a framework that makes us confident that the material we're getting in is sustainable. If we don't know that what's coming in is actually saving carbon, there is no point. But we also need something that helps those small companies to actually pick up these ideas and run faster with them. They often can be more agile, but they lack the technical support and the expertise and experience in that space, and we've got to help them to move forward. That's a really interesting point because it bounces right back to Carnegie's work with HPE. The kinds of small businesses and organisations who are pushing the boundaries of technology need support from established players with real-world expertise. HPE's work with CITO is a prime example of where expertise can make a great idea a tangible reality. and it's not just wave power which could be improved. Reinforcement learning could have a huge effect on the operation and manufacture of a variety of sustainable energy types. Reinforcement learning is actually already applied in many other contexts, especially when it comes to devices acting in complex environments. In the space of clean energy, wind energy is probably one of the most promising because it is characterized by complex machines that must adapt to unpredictable conditions like turbulences or weather conditions. For example, a possible application could be for airborne wind generators which basically use kites moved by winds at high altitudes. Using classic aerodynamics models to control those devices is difficult because of the inherent complexity of the system. So here reinforcement learning could be an alternative way to approach this problem. And then, speaking about machine learning in general, applications in clean energy devices are basically unlimited. Supervised learning is also relevant. An example is the design of solar panels components, again, to maximize the production of electricity. OK, so there's one final area that we haven't looked at yet, and that is hydrogen. It's touted as the fuel source of the future. And in fact, there are already hydrogen powered buses and trains and cars around. The best part is that the only tailpipe emission is water. So could that be the answer? It's certainly an area of opportunity, and it's one we asked a few of our guests about, but it's of particular interest for Patricia Thornley because hydrogen is one of the products they are actively working on getting out of waste biomass. We particularly focus in eBree and in Supergen. on taking wood or agricultural residues or waste materials and turning them into liquids or gases. If you've got a liquid, it's much more useful. That can be upgraded to stuff like aviation fuels. You can run it in your car. In fact, today in the UK, around 10% of what is actually being sold at petrol pumps has come from biomass in one shape or form. And most people just don't realize that. We can also do cleverer things with it. We can turn it into hydrogen. You know, I think we've all been hearing a lot about hydrogen recently. Clean fuel, great potential. Well, we can get hydrogen from biomass. And what's really clever is there are ways of doing that, where you take the biomass, which has some carbon in it, some hydrogen, and you actually split them up. Hydrogen isn't without its problems though. It's notoriously hard to store and likes to leak out of most containers. It reacts quite vigorously to oxygen, or to be less scientific, it's quite explosive, and it's very expensive to produce. Despite being the most abundant element in the universe, it has a tendency to stick to things and takes a lot of electricity to separate again. It's a piece of the puzzle for sure, but it's not one that's likely to change the world all that quickly, although there is an increased recent interest in using nickel-hydrogen batteries traditionally employed in satellites and space stations to provide large-scale electrical storage on Earth. That's a way off, though, and doesn't solve the problem of actually making electricity. So what are the next steps? That is, assuming as the old joke goes, fusion is still a decade away. For Jonathan and Carnegie Clean Energy, they are probably a few years from commercial production, and more for the technology to become mainstream. But the future looks bright. We're expecting to deploy as part of the EuropeWave program in a couple of years time. And so in parallel to that, we're developing some commercial project plans. They'll be small initially and then of course they'll grow from there. So I would think that within four years there will be some fairly large commercial projects emerging, some of the initial ones. But as we've seen with offshore wind, I mean, once you've got a technology that is capable, is relatively competitive, people will just be clamouring for it. And we've seen offshore wind go from zero in sort of 2000 to six gigawatts deployed per year. So only 20 years later. So, you know, that is a massive step up and that sort of gives you a sense of what's possible. For Patricia, it's about taking proven, efficient chemical waste to energy technology and pushing it into the commercial world. I'm going to admit that I did my PhD a very long time ago. And when I did it, I actually worked on gasification. I went into the commercial sector and I thought we were going to make these plants work. But it was really hard. When you're building things at scale in the real world, you're under time pressure, you're under financial pressure, and trying to make new technologies work when you've got, you know, limited time, limited resources, limited expertise is actually a really hard thing to do. You've got to have the right support frameworks in place. And I suppose that's one of the things that we try to do via Supergen and EBRI. We also work a lot with government to try and help them understand where the potential lies and what technologies are going to need subsidising, to what extent. So if we can get those two things right, if we can get the recognition via policy frameworks, around the carbon benefits of these and the economic incentive that they then need to happen and we can get the academic expertise in to help when people are trying to build and prove these things and having problems with it, then I think that's how we crack this. For me, I call it the golden triangle of academic industry policy. The pragmatic answer, according to some experts, is that in the next 10-20 years, we'll see renewable sources – wind, solar and biomass – become an increasing piece of the pie. We'll also see natural gas, which burns far more cleanly than other traditional hydrocarbons such as oil and coal, become more prominent. Nuclear will also probably make a comeback before fusion arrives, and even then, for many governments around the world, the priority will simply be to get their people any kind of reliable electricity to stop the necessity of burning fossil fuels in their homes. Over time though, predictions suggest the global population will level out, and as it does so in around 2050, demand will plateau and we can start to make a real dent in the world's energy needs whilst relying less and less on the old dirty burning fuels. That's not exactly a hopeful answer, but a lot has changed in the way we make our electricity in the last 30 years. And who knows what the next 30 will bring? Realistically, global level pragmatism probably is the best solution. But that shouldn't stop us from pushing to do better, as all of our guests today have dedicated their lives to doing. And given the massive push towards sustainability we're seeing in the tech field and the work HPE and others are doing on optimizing new technology from fusion to wave generators, that change might be getting the boost it deserves. You've been listening to Technology Untangled. We've been your hosts, Michael Byrd and Aubrey Lovell. And a huge thanks to our guests, Doug Cothie, Patricia Thornley, Christian Tamparale, Maria Rirejo, and Jonathan Fierbe. You can find more information on today's episode in the show notes. And this is the third episode in the fourth series of Technology Untangled. And next time, we are exploring how to get more out of the energy that we already have. So do make sure you subscribe on your podcast app of choice, so you don't miss out. And to check out the last three series. Today's episode was written and produced by Sam Datta-Paulin, Michael Byrd, and myself, Aubrey Lovell. Sound design and editing was by Alex Bennett with production support from Harry Morton, Alison Paisley, Alicia Kempson, Alex Podmore, Alyssa Mitri, and Camilla Patel. Technology Untangled is a Lower Street production for Hewlett Packard Enterprise."
    },
    "podcast_summary": "In this podcast, the hosts discuss the challenges of nuclear fusion as a future energy source and the need for immediate solutions using existing technologies. The podcast covers topics such as biomass, wave power, hydrogen, and the role of AI in improving energy efficiency. While fusion is still a long way off, other sustainable energy sources can help bridge the gap and meet the growing energy demand. The guests discuss the importance of supporting small companies and implementing sustainable practices to achieve a greener future.",
    "podcast_guest": {
        "name": "Jonathan Fieve",
        "job": "CEO of Carnegie Clean Energy",
        "wiki_title": "",
        "wiki_summary": "",
        "wiki_url": "",
        "wiki_img": "",
        "google_URL": "https://www.carnegiece.com/portfolio/jonathan-fievez/"
    },
    "podcast_highlights": "- Highlight 1 of the podcast: \"For the first time, they managed to get more energy out of fusing two atoms together than it took to run the process, an event known as ignition.\"\n- Highlight 2 of the podcast: \"In 2023, on average, we use 60 kilowatt hours of electrical energy each, per day. That's enough to boil approximately 600 liters of water, or about 160 gallons.\"\n- Highlight 3 of the podcast: \"Biomass, farm waste included, really is a huge provider of energy. And in the UK alone, burning biomass supplies 40% of renewable energy generation and 5% of total US production.\"\n- Highlight 4 of the podcast: \"You know, I think we've all been hearing a lot about hydrogen recently. Clean fuel, great potential. Well, we can get hydrogen from biomass.\"\n- Highlight 5 of the podcast: \"We're expecting to deploy as part of the EuropeWave program in a couple of years time. And so in parallel to that, we're developing some commercial project plans.\""
}